{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Iron & Steel — WWI Iron Harvest",
  "packId": "ww1_iron_harvest",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Mark I (Male)",
      "desc": "The first tank to see combat. She rolled across no man's land at Flers-Courcelette in September 1916 and nothing in the German arsenal could stop her. Rhomboidal tracks, sponson-mounted naval guns, and a crew of eight who could barely hear each other over the engine. She terrified everyone — including the men inside her.",
      "notes": "The Male variant carries two 6-pounder guns in the sponsons — anti-fortification weapons that crack bunkers and strongpoints. She's painfully slow and mechanically unreliable. Roll Vigor for the crew each hour of operation — the heat, fumes, and noise inside are genuinely debilitating. Breakdowns should be frequent and dramatic.",
      "image": "",
      "size": 8,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": 0,
      "speedLevel": -4,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Mark I (Female)",
      "desc": "Same hull as the Male, but the sponson guns replaced with machine guns. She was designed to sweep trenches clean of infantry while the Males cracked the fortifications. In practice she was just as terrifying — a steel monster pouring automatic fire into positions that had been impregnable for two years.",
      "notes": "The Female is your anti-infantry variant. She lacks the punch to crack bunkers but her machine guns suppress everything in the open. Use both variants together as they were historically deployed — Males break the strongpoints, Females clear the trenches behind them.",
      "image": "",
      "size": 8,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": 0,
      "speedLevel": -4,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Mark IV",
      "desc": "The improved Mark I with thicker armour, better ventilation, and an unditching beam bolted across the roof. She fought at Cambrai in 1917 — the first massed tank attack in history, where nearly five hundred tanks broke through the Hindenburg Line in a single morning.",
      "notes": "The Mark IV is the Mark I that actually works. Better armour stops the German K-bullet that could penetrate the Mark I's sides. The unditching beam is a special ability — she can self-recover from bogging without external assistance. Use her for Cambrai and the 1918 breakthrough battles.",
      "image": "",
      "size": 8,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": -3,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Medium Mark A Whippet",
      "desc": "Fast by Great War standards — fourteen miles an hour, which is faster than a man can run. She was designed to exploit the gaps the heavy tanks made, racing through into the rear areas to wreak havoc on artillery batteries, headquarters, and supply lines.",
      "notes": "The Whippet is your exploitation vehicle. She's fast enough to catch retreating infantry and light enough to cross ground the heavies can't. Use her for pursuit scenarios after a breakthrough — the players in Whippets chasing a retreating enemy through shattered terrain while the heavies grind forward behind them.",
      "image": "",
      "size": 6,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -1,
      "speedLevel": -1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "A7V Sturmpanzerwagen",
      "desc": "Germany's answer to the British tank. A steel box the size of a house, carrying a crew of eighteen and bristling with guns in every direction. Only twenty were ever built. She met the Mark IV at Villers-Bretonneux in 1918 — the first tank-versus-tank battle in history.",
      "notes": "The A7V is a mobile fortress with a massive crew. Her high centre of gravity makes her unstable on broken ground — she can tip over on steep slopes, which is historically accurate and mechanically dramatic. Use her for the Villers-Bretonneux scenario: the first time tanks fight tanks, and nobody has any doctrine for it.",
      "image": "",
      "size": 9,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": -4,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Renault FT-17",
      "desc": "The tank that invented the modern tank. She has a rotating turret — the first ever fitted to an armoured vehicle — a two-man crew, and a silhouette small enough to hide behind a garden wall. Every tank built since owes its basic layout to the FT.",
      "notes": "The FT is small, cheap, and deployed in swarms. Individually she's fragile and undergunned, but thirty of them advancing together overwhelm any defence. Use her in numbers — a single FT is a curiosity, a platoon of FTs is a breakthrough. Her small size also makes her the first tank that can operate in urban terrain.",
      "image": "",
      "size": 4,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Mark V",
      "desc": "The first tank that one man could drive. Her predecessors needed four men wrestling with gears and brakes to steer — the Mark V has an epicyclic gearbox that gives the driver actual control. She also has better ventilation, which means the crew can function for more than an hour without collapsing.",
      "notes": "The Mark V is your late-war British workhorse. She's mechanically reliable compared to the Mark I, which means fewer breakdown rolls. She also carries troops in an extended version — infantry riding inside a tank across no man's land, dismounting at the objective. Use her for the 1918 Hundred Days offensive.",
      "image": "",
      "size": 8,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": -3,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Saint-Chamond",
      "desc": "France's heavy tank. She carries a 75mm field gun in the nose and an electric transmission that was revolutionary for 1917. She's also front-heavy, nose-dives into every shell crater, and gets stuck with depressing regularity. A brilliant concept let down by physics.",
      "notes": "The Saint-Chamond is your 'good on paper, bad in practice' vehicle. Her gun is excellent — a proper field gun, not a naval weapon. But she bogs down constantly. Every time she crosses rough terrain, there's a real chance she sticks. Use her to demonstrate that early tanks were as much a threat to their own crews as the enemy.",
      "image": "",
      "size": 8,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": 0,
      "speedLevel": -4,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Schneider CA1",
      "desc": "France's first tank, based on a Holt tractor chassis with armour plate bolted on. She carries a short 75mm gun on the right side and two machine guns. She entered service at Berry-au-Bac in 1917, where the Germans discovered that concentrated artillery fire could still destroy tanks.",
      "notes": "The Schneider is fragile for a tank — her fuel tanks are external and vulnerable to fire. A critical hit that ignites the fuel is catastrophic. Use her to show the learning curve of early armoured warfare — the first attacks were brave and disastrous in roughly equal measure.",
      "image": "",
      "size": 7,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": 0,
      "speedLevel": -3,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Rolls-Royce Armoured Car",
      "desc": "A Rolls-Royce Silver Ghost chassis with a machine gun turret bolted on top. She was fast, reliable, and utterly useless in the mud of the Western Front — but in the deserts of Arabia, Mesopotamia, and East Africa she was devastating. Lawrence of Arabia used them to terrorise Turkish supply lines.",
      "notes": "The armoured car is your mobility vehicle for theatres outside the trenches. She's fast on roads and hard ground, useless in mud. Use her for Middle Eastern and African campaigns where speed matters more than armour. She's also perfect for inter-war policing, colonial campaigns, and the Irish War of Independence.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": 1,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    }
  ]
}