{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Chrome & Fury — Wasteland Fleet",
  "packId": "wasteland_fleet",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "War Rig",
      "desc": "Eighteen wheels of diesel-powered fury, armoured in salvaged plate, and carrying enough supplies to keep a settlement alive for a month. She's the lifeline of the wasteland — the beast that runs the trade routes between fortress-towns while every raider gang in the desert tries to stop her.",
      "notes": "The war rig is your campaign centrepiece. She's the thing the players protect, drive, or hunt. A convoy run across hostile wasteland is a self-contained adventure — the rig moves, the raiders attack, and the players fight from the moving vehicle at highway speed. Pure Fury Road.",
      "image": "",
      "size": 10,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 0,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Interceptor",
      "desc": "A muscle car stripped to the essentials and supercharged until the engine screams. She's the fastest thing on the broken highways, built for one purpose: catching other vehicles and making them stop. Permanently.",
      "notes": "The interceptor is your player vehicle. She's fast, she's aggressive, and she's personal. Every interceptor is unique — modified by its driver, patched with whatever was available, and held together by stubbornness. She's the character's second identity.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -1,
      "speedLevel": 4,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Buzz Buggy",
      "desc": "A dune buggy with a mounted weapon and a driver who doesn't care about dying. She's light, she's fast over sand and rubble, and she carries a single gunner who fires while the driver swerves through the debris field. She's expendable. Her crew know it.",
      "notes": "The buzz buggy is your swarm vehicle. One is a nuisance. Eight are a crisis. They surround the war rig, harry the escorts, and the gunners fire from every direction. Use them in packs — individually fragile, collectively overwhelming.",
      "image": "",
      "size": 2,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -2,
      "armourLevel": -3,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Thunder Bus",
      "desc": "A school bus welded shut, armour-plated, and carrying a war party of thirty raiders who pour out of the emergency exits screaming. She's a troop transport for people who don't have APCs — ugly, effective, and terrifying when she pulls alongside and the doors open.",
      "notes": "The thunder bus delivers boarding parties. She pulls alongside the war rig, the doors open, and raiders swarm across. The players fight a rolling melee at highway speed while both vehicles sway and smash into each other. It's chaos, and it's glorious.",
      "image": "",
      "size": 8,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Fuel Tanker",
      "desc": "Liquid gold on wheels. She carries the fuel that keeps the wasteland moving, and she's the most valuable target on any trade route. Every raider gang wants her contents. Every settlement needs them. She's the reason wars start.",
      "notes": "The fuel tanker is the MacGuffin. Whoever controls the fuel controls the wasteland. She's also a rolling bomb — a lucky shot ignites the cargo and the explosion kills everything within a block. That risk makes every firefight near her a terrifying gamble.",
      "image": "",
      "size": 9,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": -1,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Scrap Crawler",
      "desc": "Half tank, half tractor, all salvage. She's built from the wreckage of a dozen other vehicles, held together with welding and prayer, and she crawls across terrain that stops wheeled vehicles dead. She's slow, she's ugly, and she gets there.",
      "notes": "The scrap crawler is your all-terrain vehicle. She crosses rubble, sand, and broken ground that the interceptors can't handle. Use her for expeditions into the deep waste where the roads have been gone for decades. Her slow speed means encounters last longer — no outrunning anything.",
      "image": "",
      "size": 6,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Death Bike",
      "desc": "A motorcycle with spikes, a sidecar-mounted weapon, and a rider who considers protective equipment a sign of weakness. She's fast, she's loud, and she announces the raider warband's arrival about thirty seconds before everything goes sideways.",
      "notes": "The death bike is your outrider. She scouts ahead of the raider convoy, harasses the flanks of the war rig, and her rider throws improvised explosives at close range. Use them in groups of four to six, buzzing around the convoy like angry wasps.",
      "image": "",
      "size": 1,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 3,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Spike Truck",
      "desc": "A pickup truck with welded armour, a ram bar covered in sharpened steel, and a mounted weapon in the bed. She's the standard fighting vehicle of the wasteland — available, modifiable, and lethal enough to make the point without needing to be subtle about it.",
      "notes": "The spike truck is your default wasteland combat vehicle. She's everywhere, she's dangerous, and every raider gang has a dozen. Use her as the standard opposition — recognisable, threatening, and destructible enough that the players feel powerful when they wreck one.",
      "image": "",
      "size": 6,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": 0,
      "speedLevel": 1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Sand Yacht",
      "desc": "A sail-powered land vehicle that uses the desert wind to glide across flat terrain at surprising speed. No fuel, no engine, no noise. She's the stealth vehicle of the wasteland — she arrives silently, she carries a raiding party, and she leaves no fuel trail to follow.",
      "notes": "The sand yacht is your silent approach vehicle. She uses no fuel, which means she can operate indefinitely. Use her for nomadic cultures that travel the deep desert, arriving at settlements without warning. She's also the escape vehicle when the fuel runs out and the wind is the only power left.",
      "image": "",
      "size": 4,
      "loco": "water_sail",
      "mods": {},
      "weapons": [],
      "toughLevel": -3,
      "armourLevel": -4,
      "speedLevel": 0,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Convoy Fortress",
      "desc": "A vehicle so heavily modified she's barely mobile — layers of armour, multiple weapon positions, and a command centre in what used to be the passenger compartment. She doesn't chase. She parks at the centre of the convoy and everything else orbits her.",
      "notes": "The convoy fortress is your mobile stronghold. She anchors the convoy's defence and provides coordinated fire. She's too slow to chase but too tough to ignore. Use her as the war rig's escort commander — the vehicle that organises the defence when the raiders attack.",
      "image": "",
      "size": 12,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 3,
      "armourLevel": 2,
      "speedLevel": -3,
      "handlingLevel": -4,
      "woundsLevel": 0
    }
  ]
}