{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Chrome & Fury — Spy Vehicles",
  "packId": "spy_vehicles",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Spy Car (Classic)",
      "desc": "An Aston Martin with hidden machine guns behind the headlights, an ejector seat, a smokescreen dispenser, and a revolving number plate. She's the quintessential spy car — elegant above, lethal beneath, and equipped for situations that no civilian vehicle should ever encounter.",
      "notes": "The spy car is pure Bond fantasy. Every modification is a gadget the players can trigger once — machine guns, oil slick, smoke screen, ejector seat. Build a chase where they need to use each gadget at the right moment. Once they're spent, the car is just a very expensive sedan.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": 1,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Stealth Motorcycle",
      "desc": "Electric drive, radar-absorbent paint, and a silhouette designed to minimise visual detection. She's virtually silent at low speed and nearly invisible at night. The perfect vehicle for infiltration — she gets the operative to the target without anyone knowing they've arrived.",
      "notes": "The stealth bike is your insertion vehicle. Silent approach, minimal signature, and fast extraction. Use her for covert missions where the players need to reach a location undetected. She can't fight, but if she's fighting, the mission has already failed.",
      "image": "",
      "size": 1,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Pursuit Helicopter",
      "desc": "A light helicopter operated by the agency's air division. She carries surveillance equipment, a sniper-rated door gunner, and the ability to follow a target from three thousand feet where no one on the ground looks up.",
      "notes": "The spy helicopter provides overhead surveillance and extraction. She shadows targets, photographs meetings, and swoops in for rooftop pickups. Use her as the players' eye in the sky or the thing following them when they realise their cover is blown.",
      "image": "",
      "size": 6,
      "loco": "vtol",
      "mods": {
        "enhanced_sensors": 1
      },
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "rocket_pod",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -1,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Submersible Car",
      "desc": "A sports car that transforms into a submarine. She drives off the pier, seals her cabin, extends dive planes, and cruises underwater to a point where no one is watching. She then drives up the beach and continues as if nothing unusual happened. Because in this line of work, it hasn't.",
      "notes": "The submersible car is your ultimate spy gadget. She transitions from road to water seamlessly, which means escape routes nobody expects. Use her for the dramatic moment — pursued to the coast, the players drive off the cliff and disappear beneath the waves.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {
        "amphibious": 1
      },
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": 0,
      "speedLevel": 0,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Surveillance Van",
      "desc": "A nondescript panel van packed with listening equipment, camera feeds, satellite uplinks, and enough screens to monitor an entire building. She parks on a residential street and nobody looks twice. Inside, three operatives are recording everything the target does.",
      "notes": "The surveillance van is your mission control. She's where the players plan, monitor, and coordinate. The tension is the stakeout — hours of watching, then sudden action when the target moves. She's also vulnerable: if the enemy finds the van, the entire operation is blown.",
      "image": "",
      "size": 5,
      "loco": "wheeled",
      "mods": {
        "enhanced_sensors": 1
      },
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Armed Speedboat",
      "desc": "A rigid inflatable with a powerful outboard and a concealed weapon mount. She's the water taxi for covert operations — fast insertion along coastlines, harbour infiltration, and extraction from waterfront locations where road access is compromised.",
      "notes": "The armed speedboat is your coastal insertion vehicle. She carries a small team at speed across water and drops them on a hostile shore. The concealed weapons only appear when the mission goes loud. Use her for harbour raids, island approaches, and yacht interceptions.",
      "image": "",
      "size": 5,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -1,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Gyrocopter",
      "desc": "A single-seat autogyro small enough to fit in a shipping container. She launches from a car park, flies at low altitude below radar coverage, and lands on any flat surface larger than a tennis court. She's the personal aircraft for agents who need to be somewhere the roads don't go.",
      "notes": "The gyrocopter is your personal air transport. She carries one operative and a small equipment case. Use her for rooftop insertions, aerial surveillance, and the escape route nobody expected — the agent lifts off from the embassy roof while the guards are still checking the gate.",
      "image": "",
      "size": 2,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "rocket_pod",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -3,
      "armourLevel": -4,
      "speedLevel": 0,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Armoured Limo",
      "desc": "Stretched, armoured, and carrying enough defensive systems to survive an ambush that would destroy a convoy. Run-flat tyres, smokescreen, electromagnetic pulse hardening, and armour that stops rifle rounds at point-blank range. The passenger doesn't even spill their drink.",
      "notes": "The armoured limo is your VIP transport for spy campaigns. She protects the asset — the defector, the informant, the diplomat. Use her for ambush scenarios where the enemy tries to stop the limo and the players must get the passenger to safety.",
      "image": "",
      "size": 6,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": 0,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Jet Pack",
      "desc": "A personal flight system strapped to the operator's back. Thirty seconds of powered flight — enough to clear a building, cross a river, or escape a compound. She's loud, she's conspicuous, and she provides the kind of dramatic exit that spy agencies officially disapprove of and unofficially love.",
      "notes": "The jet pack is your one-use escape tool. Thirty seconds of flight — that's five rounds. The players need to plan exactly when to use it and where to land. It's the extraction method when every other option has failed. Spectacular, brief, and unrepeatable.",
      "image": "",
      "size": 0,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -4,
      "armourLevel": -5,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Q-Branch Special",
      "desc": "Whatever the mission requires. She looks like a standard vehicle — taxi, delivery truck, ambulance — but underneath the disguise she carries mission-specific modifications that the quartermaster installed overnight and will deny all knowledge of tomorrow.",
      "notes": "The Q-Branch Special is your custom gadget vehicle. The players request modifications for a specific mission and Q-Branch delivers something that almost works as specified. Use her to let the players design their own spy car — within reason — and then introduce the complication that one gadget doesn't work quite right.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": 3,
      "handlingLevel": 2,
      "woundsLevel": 0
    }
  ]
}