{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Chrome & Fury — Chase Starter",
  "packId": "chase_starter",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "note": "Core weapons only. For extended chase rules, sideswipe/ram, convoy defence, train combat, and gadgets, see the full Chrome & Fury supplement.",
  "vehicles": [
    {
      "name": "Pursuit Muscle Car",
      "desc": "Big engine, rear-wheel drive, and the kind of acceleration that pins you to the seat. She's loud, she's fast, and she leaves rubber on every surface she touches. The classic getaway car for anyone who values speed over subtlety.",
      "notes": "The muscle car is your default chase vehicle. She wins straight-line speed contests and loses in tight turns. Use her for highway pursuits where raw speed matters. Her engine note is distinctive — witnesses always remember the muscle car.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": 3,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Police Interceptor",
      "desc": "A civilian sedan with a police-spec engine, upgraded brakes, reinforced bumpers, and a push bar on the front designed for the Pursuit Intervention Technique. She's built to chase and she's built to ram. The lights and siren are optional extras.",
      "notes": "The interceptor is your pursuit specialist. She's fast, she handles well, and the push bar means she can PIT manoeuvre fleeing vehicles. Use her as both threat and tool — the players are being chased by one or driving one. The radio connection means backup is always en route.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Armoured Escort",
      "desc": "A blacked-out SUV with ballistic glass, run-flat tyres, and armour plating hidden beneath the civilian bodywork. She protects VIPs, she transports valuables, and she absorbs gunfire that would shred a normal vehicle without losing speed.",
      "notes": "The armoured escort is your VIP transport. She takes hits and keeps moving. Use her for protection details where the players convoy a target through hostile territory. Her armour is concealed — the enemy doesn't know she's hardened until they start shooting and nothing happens.",
      "image": "",
      "size": 6,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Pursuit Bike",
      "desc": "A litre-class sportbike with more acceleration than common sense. She splits lanes, she threads through traffic, and she goes from zero to a hundred and fifty in the time it takes a car to clear the intersection. The rider is completely exposed.",
      "notes": "The pursuit bike dominates in traffic. She goes through gaps that cars can't. Use her for urban chases where the bike weaves through congestion while the cars are stuck. The rider's vulnerability is the trade-off — one hit and there's no vehicle to protect them.",
      "image": "",
      "size": 1,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 3,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Getaway Van",
      "desc": "A panel van with a tuned engine and no rear windows. She carries the crew, the loot, and whatever equipment the job required. She's not fast, she's not flashy, and that's exactly the point. Nobody looks twice at a white van.",
      "notes": "The getaway van is your post-heist vehicle. She carries the whole party and the score. Her anonymity is her defence — switch plates, park in a loading bay, and she vanishes. She's also the surveillance vehicle, the mobile armoury, and the rolling base of operations.",
      "image": "",
      "size": 5,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Convoy Truck",
      "desc": "An eighteen-wheeler carrying legitimate cargo — or whatever someone wants moved across state lines without questions. She's slow, she's heavy, and she doesn't stop easily. She also doesn't turn easily, which makes highway ambushes against her a favourite of everyone from hijackers to federal agents.",
      "notes": "The convoy truck is your escort target or your mobile obstacle. She carries the MacGuffin and she can't defend herself. The players protect her, ambush her, or drive her through a roadblock. Her weight makes her a devastating ram but her handling makes precise manoeuvring impossible.",
      "image": "",
      "size": 8,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Sports Coupe",
      "desc": "Mid-engine, low-slung, and worth more than most people's houses. She corners like she's on rails and accelerates like she's been insulted. The sports coupe is the car you steal when you need to outrun something very fast and look good doing it.",
      "notes": "The sports coupe is your handling champion. She wins in twisting mountain roads and urban environments where cornering matters more than straight-line speed. Use her for the dramatic car chase through narrow European streets.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -2,
      "speedLevel": 3,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Pursuit Helicopter",
      "desc": "A light helicopter fitted with a searchlight, a thermal camera, and a pilot who knows every rooftop and alley in the city. She follows from above, directs ground units, and makes escape nearly impossible. You can outrun a car. You can't outrun a helicopter.",
      "notes": "The pursuit helicopter changes the chase entirely. She tracks from above, which means hiding in traffic doesn't work. The players need to break line of sight — tunnels, parking garages, overpasses. Use her to escalate a routine chase into a desperate escape.",
      "image": "",
      "size": 6,
      "loco": "vtol",
      "mods": {
        "enhanced_sensors": 1
      },
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -1,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Armoured SUV",
      "desc": "A luxury SUV with factory-installed ballistic protection. She carries executives, diplomats, and anyone else who expects to be shot at during their commute. Heavy, fast enough, and armoured against everything up to rifle-calibre fire.",
      "notes": "The armoured SUV is your corporate vehicle. She screams 'money and paranoia' in equal measure. Use her for executive protection, cartel convoys, and diplomatic scenarios. She's tougher than she looks but she's also heavier, which shows in sharp turns.",
      "image": "",
      "size": 5,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Supercar",
      "desc": "Seven hundred horsepower, carbon fibre bodywork, and a price tag with six zeros. She's the fastest legal vehicle on any public road and the most expensive thing the players will ever crash into a guardrail. She doesn't transport people. She makes statements.",
      "notes": "The supercar is your top-end pursuit vehicle. She's faster than the interceptor, she handles better than the muscle car, and she costs more than everything else in the chase combined. Use her for the villain's escape vehicle, the reward the players can't resist, or the thing they accidentally destroy.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -2,
      "speedLevel": 4,
      "handlingLevel": 3,
      "woundsLevel": 0
    }
  ]
}