{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Wire & Chrome — Cyberpunk Fleet",
  "packId": "cyberpunk_fleet",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Corp Executive AV",
      "desc": "The top-tier corporate aerial vehicle. Stealth coating, countermeasures, and a minibar. She carries C-suite executives between arcologies and the occasional board member who needs to disappear before the SEC arrives.",
      "notes": "The executive AV is the upgraded corp vehicle. She's stealthier, better armed, and more luxurious. Use her for high-level corporate encounters where the players interact with — or target — people who can end careers and lives with a phone call.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Street Racer",
      "desc": "The expanded variant — more modifications, more power, and the kind of aftermarket additions that only exist because someone with a soldering iron had a bad idea at three in the morning. She's illegal in ways that haven't been legislated yet.",
      "notes": "The fleet street racer has more modification slots, representing deeper customisation. Use her for characters who've invested in their vehicle over a campaign. She should feel personal and irreplaceable — a character in her own right.",
      "image": "",
      "size": 3,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -2,
      "speedLevel": 4,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Tactical Drone Swarm",
      "desc": "Not one drone — twenty. A coordinated swarm that thinks, moves, and kills as a single entity. She blankets an area, identifies threats, and eliminates them with focused fire from multiple angles simultaneously. She is the replacement for the infantry squad.",
      "notes": "The drone swarm is your area-denial weapon. She fills a space with flying guns. The players can't fight twenty targets individually — they need to find the controller, jam the signal, or use area-effect weapons. She changes the tactical picture completely.",
      "image": "",
      "size": 2,
      "loco": "vtol",
      "mods": {
        "unmanned": 1
      },
      "weapons": [
        {
          "weaponId": "slug_med",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -3,
      "armourLevel": -3,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Armoured Riot Van",
      "desc": "The military-grade version. Active denial systems, lethal and non-lethal weapon suites, and armour that stops everything short of anti-vehicle weapons. She's what the corporation sends when the riot van isn't enough.",
      "notes": "The upgraded riot van is the escalation vehicle. She appears when the corporation stops caring about optics. Her weapons are lethal, her armour is serious, and her presence means someone has authorised deadly force.",
      "image": "",
      "size": 6,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 0,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Courier Bike",
      "desc": "The upgraded courier — stealth systems, countermeasures, and a cargo compartment lined with signal-blocking material. She carries packages that don't officially exist between people who don't officially know each other.",
      "notes": "The fleet courier has counter-surveillance capability. She defeats tracking, she blocks scanning, and her rider is invisible to the city's sensor grid. Use her for black operations where the delivery itself is the crime.",
      "image": "",
      "size": 1,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Merc APC",
      "desc": "The premium mercenary vehicle. Better armour, better weapons, and a command suite that lets the team leader coordinate with corporate clients in real-time. She's the vehicle of professional violence — efficient, expensive, and morally flexible.",
      "notes": "The fleet merc APC is the top-tier hired muscle vehicle. She carries a full team with heavy weapons. Use her for the final act when the corporation sends its best contractors to solve the players permanently.",
      "image": "",
      "size": 7,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Spider Tank",
      "desc": "The heavy variant. Thicker armour, heavier weapons, and a tactical AI that learns from each engagement. She's the corporate military's answer to urban warfare — a vehicle that fights in the city as effectively as a tank fights in the field.",
      "notes": "The fleet spider tank is your campaign boss vehicle. She's tougher, smarter, and her AI adapts to the players' tactics. The second encounter is harder than the first because she's learned. The players need new strategies every time.",
      "image": "",
      "size": 6,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_mod",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": -1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Hacker Van",
      "desc": "A nondescript van packed with server racks, antenna arrays, and enough computing power to crack corporate firewalls from a parking space. She's the netrunner's office — mobile, anonymous, and close enough to the target for a direct connection.",
      "notes": "The hacker van is your cyberpunk surveillance and intrusion vehicle. She provides the netrunner with the hardware to attack corporate systems. She needs to be close to the target, which means parking in dangerous locations while the hacker works. Physical security is someone else's problem.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {
        "enhanced_sensors": 1
      },
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": 0,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Cargo Drone",
      "desc": "The heavy-lift variant. She carries shipping containers between corporate warehouses on automated routes. She's the backbone of urban logistics — and the biggest prize for anyone who can hack her navigation system.",
      "notes": "The heavy cargo drone carries serious loads. Hijacking one means redirecting a shipping container's worth of corporate property. Use her for large-scale heists where the players need to steal something the size of a vehicle.",
      "image": "",
      "size": 4,
      "loco": "vtol",
      "mods": {
        "unmanned": 1
      },
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -3,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Luxury Hover-Limo",
      "desc": "The top of the line. Military-grade countermeasures, a full ECM suite, and armour that stops anti-vehicle weapons. The person inside her is so wealthy that their vehicle has a better defence budget than most neighbourhoods. She is inequality made aerodynamic.",
      "notes": "The luxury hover-limo is the ultimate status vehicle. She's essentially a mobile fortress for one person. Use her for the final meeting with the campaign's corporate antagonist — the person who's been making the players' lives hell, floating serenely above the consequences.",
      "image": "",
      "size": 6,
      "loco": "hover",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": 1,
      "handlingLevel": 0,
      "woundsLevel": 0
    }
  ]
}