{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Wire & Chrome — Cyberpunk Starter",
  "packId": "cyberpunk_starter",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "note": "Core weapons only. For vehicle hacking, drone operations, corporate escalation, and electronic warfare, see the full Wire & Chrome supplement.",
  "vehicles": [
    {
      "name": "Corp AV",
      "desc": "Corporate aerial vehicle. VTOL, armoured, and carrying the executives who own the city. She flies above the traffic, above the crime, and above the consequences. The logo on her hull is the only law that matters at this altitude.",
      "notes": "The corp AV is your cyberpunk helicopter. She represents corporate power — flying over the street-level chaos. Use her for executive transport, corporate extraction, and the dramatic moment when the corp decides the players are a problem worth solving from the air.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Street Racer",
      "desc": "Neon underglow, a boosted engine, and aftermarket armour that voids every warranty the car ever had. She races through the lower city at speeds that kill pedestrians and occasionally her own driver. She's the street samurai's ride — fast, loud, and personal.",
      "notes": "The street racer is your player vehicle. She's customised, she's personal, and she's fast enough for the neon-lit chase scenes the genre demands. Let players modify her — every upgrade tells a story about the character.",
      "image": "",
      "size": 3,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -2,
      "speedLevel": 4,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Tactical Drone",
      "desc": "An armed quadcopter the size of a dinner plate. She carries a camera, a light weapon, and enough AI to identify and engage targets autonomously. She costs less than a night out and she kills with clinical efficiency.",
      "notes": "The tactical drone is your cyberpunk minion. She's cheap, she's disposable, and she appears in swarms. Use them as corporate security — the building doesn't have guards, it has a drone bay. They're individually fragile but they keep coming.",
      "image": "",
      "size": 2,
      "loco": "vtol",
      "mods": {
        "unmanned": 1
      },
      "weapons": [
        {
          "weaponId": "slug_med",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -3,
      "armourLevel": -3,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Merc APC",
      "desc": "Mercenary armoured personnel carrier. Surplus military hardware with the serial numbers filed off, maintained by private contractors who ask no questions and charge by the hour. She carries a fire team and enough weapons to start a small war.",
      "notes": "The merc APC is your hired muscle vehicle. She shows up when someone's paid for serious firepower. Use her for corporate hits, extraction operations, and the moment when the players realise the opposition has upgraded from gangers to professionals.",
      "image": "",
      "size": 7,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Spider Tank",
      "desc": "Six legs, a turret, and the ability to climb walls. She's the nightmare of urban warfare — she rounds a corner by walking up the building and appearing on the wall above you. She fights in three dimensions in an environment designed for two.",
      "notes": "The spider tank is your cyberpunk boss vehicle. She climbs buildings, she drops from overpasses, and she engages from angles that conventional vehicles can't reach. Use her as the set-piece combat encounter that makes the players re-think their tactical assumptions.",
      "image": "",
      "size": 6,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_mod",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": -1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Courier Bike",
      "desc": "Electric motorcycle with GPS spoofing, encrypted storage, and enough speed to outrun corporate pursuit vehicles. She carries data, samples, and small packages between clients who don't want a digital trail. The rider doesn't ask what's in the case.",
      "notes": "The courier bike is your cyberpunk messenger vehicle. She's fast, she's discreet, and her cargo is always important. Use her for delivery missions where the package is the plot hook and every faction in the city wants what the rider's carrying.",
      "image": "",
      "size": 1,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Armoured Riot Van",
      "desc": "Corporate police vehicle. Water cannon, tear gas dispensers, and room for a squad of officers in full riot gear. She shows up when the protests get too loud and the corporation decides that public opinion is less important than public order.",
      "notes": "The riot van is your urban control vehicle. She suppresses crowds with non-lethal weapons — which become lethal quickly when the corporation decides it's necessary. Use her for protest scenarios, extraction through hostile crowds, and the moment when corporate security stops pretending to be police.",
      "image": "",
      "size": 6,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 0,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Hover Limo",
      "desc": "Anti-gravity luxury transport. She floats above the street filth, her windows are opaque from outside, and the people inside her make decisions that affect millions of lives over champagne and oysters. She's the divide between the haves and the have-nots made physical.",
      "notes": "The hover limo is your wealth-and-power vehicle. She represents everything the street-level characters don't have. Use her for meetings with corporate patrons, kidnapping scenarios, and the moment when the players realise who's really running the city.",
      "image": "",
      "size": 6,
      "loco": "hover",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": 1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Cargo Drone",
      "desc": "An autonomous delivery vehicle the size of a van. She follows pre-programmed routes through the city, carrying supplies between corporate facilities. She's unarmed, she's predictable, and she carries things worth stealing.",
      "notes": "The cargo drone is your heist target. She follows a known route at known times, carrying known cargo. The players plan the intercept, execute the heist, and disappear before the corporate response arrives. She's also useful as improvised cover during street fights.",
      "image": "",
      "size": 4,
      "loco": "vtol",
      "mods": {
        "unmanned": 1
      },
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -3,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Security Sedan",
      "desc": "A mid-range sedan with hidden armour, encrypted communications, and a panic button that summons corporate rapid response. She looks civilian. She isn't. The person in the back seat is worth more to the corporation than the car.",
      "notes": "The security sedan is your covert protection vehicle. She doesn't look armoured, which means the attackers don't know what they're dealing with until the bullets bounce off. Use her for VIP transport where discretion matters more than intimidation.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 1,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    }
  ]
}