{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Sails & Gasbags — Fantasy Skyfleet",
  "packId": "fantasy_skyfleet",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Sky Cutter",
      "desc": "A single-masted racer built for the sky lanes between trading cities. She carries mail, small cargo, and passengers who value speed over comfort. Her narrow hull slices through turbulence that batters heavier vessels, and her crew know every thermal and wind current in the region.",
      "notes": "The sky cutter is your fast transport and courier vessel. She's too small for serious combat but she outpaces everything in the sky. Use her for time-critical deliveries, messenger interception, and the opening scene where the players arrive somewhere in a hurry.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "swivel_gun",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -2,
      "armourLevel": -2,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Cloud Galleon",
      "desc": "The heavy merchant vessel of the sky trade routes. Wide-hulled, deep-keeled for stability in turbulence, and carrying enough cargo to make a city prosperous. She's armed against pirates but she's a trader first — her captain would rather talk, bribe, or run than fight.",
      "notes": "The cloud galleon is your prize and your employer. The players protect one, rob one, or crew one. Her cargo is the adventure hook — whatever she's carrying, someone wants it badly enough to attack a ship this size. The captain is always interesting, always pragmatic.",
      "image": "",
      "size": 14,
      "loco": "water_sail",
      "mods": {},
      "weapons": [
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "swivel_gun",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "War Zeppelin",
      "desc": "A rigid gasbag armoured with metal plates and carrying broadside batteries in gondolas slung beneath the envelope. She's enormous, she's slow, and she brings more guns to a sky battle than anything except a fortress. Her gasbag is vulnerable to incendiary rounds, which keeps her crew nervous.",
      "notes": "The war zeppelin is your flying battleship. She dominates through firepower but her gasbag is her Achilles' heel — incendiary weapons do double damage to the envelope. A burning zeppelin falling from the sky is one of the most dramatic images in fantasy warfare. Use it.",
      "image": "",
      "size": 16,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "bombs_ww",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Sky Skiff",
      "desc": "Smaller than the starter set version — barely more than a levitating platform with a rail. She carries one or two crew and exists for boarding actions, scouting, and the kind of desperate improvised flying that happens when the mother ship is on fire.",
      "notes": "The expansion sky skiff is your personal flyer. One pilot, no protection, maximum drama. Use her for solo missions, boarding approaches, and the moment when a player jumps off the burning ship into a skiff and flies for their life.",
      "image": "",
      "size": 3,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -3,
      "armourLevel": -4,
      "speedLevel": 2,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Dwarven Ironclad",
      "desc": "Steel hull, coal-fired engines, and gun turrets that traverse independently. She looks nothing like any other sky vessel — no sails, no levitation crystals, just brute engineering and a refusal to compromise with aesthetics. She's ugly, she's loud, and she's nearly indestructible.",
      "notes": "The dwarven ironclad is your unstoppable force. She ignores attacks that cripple wooden ships. Her weakness is fuel — she burns coal and needs regular resupply. Strand her far from a dwarven port and she's a sitting duck. Use logistics as the counter to her invulnerability.",
      "image": "",
      "size": 12,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 4,
      "armourLevel": 4,
      "speedLevel": -3,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Elven Windrunner",
      "desc": "A living vessel that responds to her captain's thoughts. She accelerates in natural wind, heals her own damage over time, and moves with a silence that makes her invisible at night. The elves consider her a partner, not a machine.",
      "notes": "The windrunner is your stealth vessel. Silent movement means she can approach undetected. Her living hull regenerates damage between encounters, which changes repair economics entirely. Use her for covert operations, reconnaissance, and encounters where the players meet something alien and beautiful.",
      "image": "",
      "size": 10,
      "loco": "water_sail",
      "mods": {},
      "weapons": [
        {
          "weaponId": "bow_battery",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -2,
      "armourLevel": -2,
      "speedLevel": 2,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Pirate Sky-Brig",
      "desc": "A standard brig modified for piracy — extra speed from oversized sails, boarding planks, grappling launchers, and a crew of desperate individuals who prefer robbery to honest work. She flies a black flag and everyone who sees it makes a quick calculation about whether running or surrendering costs less.",
      "notes": "The pirate sky-brig is your recurring antagonist. She appears, demands cargo, and the players decide whether to fight, negotiate, or surrender. Her crew are colourful, her captain is memorable, and she always escapes the first encounter to come back later. Pirates are adventure generators.",
      "image": "",
      "size": 10,
      "loco": "water_sail",
      "mods": {},
      "weapons": [
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "swivel_gun",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Goblin Balloon Bomb",
      "desc": "A patchwork balloon carrying a basket full of explosives, piloted by a goblin who's been told this is an honour. She floats toward the enemy fleet, the goblin lights the fuse, and — in theory — jumps out with a parachute before the explosion. The parachute works about half the time.",
      "notes": "The goblin balloon bomb is your comic relief and your genuine threat. She's absurd, she's unreliable, and when she hits something the explosion is spectacular. The goblin pilot is terrified, enthusiastic, or philosophically resigned, depending on how dark your table likes its humour.",
      "image": "",
      "size": 4,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "bombs_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -4,
      "armourLevel": -5,
      "speedLevel": -1,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Royal Flagship (Sky)",
      "desc": "The crown's vessel. Enchanted from keel to masthead, crewed by the realm's finest sailors, and carrying weapons that blend magic and gunpowder into something that makes enemy captains surrender on sight. She's the symbol of royal authority in the sky.",
      "notes": "The expansion flagship is your ultimate allied or enemy vessel. She defines the power ceiling of the setting — nothing in the sky can match her. Use her for the campaign's climactic battle, the royal escort mission, or the terrifying moment when she arrives as the enemy's reinforcement.",
      "image": "",
      "size": 18,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 3,
      "armourLevel": 2,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Dragon-Rider Platform",
      "desc": "Not a vehicle but a harness — a reinforced saddle, armoured barding, and weapon mounts fitted to a dragon large enough to carry a rider into battle. She's the closest thing to a fighter aircraft in a fantasy setting, and she comes with a mind of her own.",
      "notes": "The dragon platform is your fantasy fighter-jet. She combines vehicle rules with the dragon's own stats — the dragon provides movement and natural weapons, the platform adds armour and mounted weapons. The rider-dragon relationship is the roleplaying hook. Dragons are not motorcycles. They have opinions.",
      "image": "",
      "size": 8,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "bow_battery",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -1,
      "speedLevel": 0,
      "handlingLevel": 1,
      "woundsLevel": 0
    }
  ]
}