{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Sails & Gasbags — Skyship Starter",
  "packId": "skyship_starter",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "note": "Core weapons only. For buoyancy, gas cell vulnerability, aerial boarding, and altitude weather rules, see the full Sails & Gasbags supplement.",
  "vehicles": [
    {
      "name": "Sky Skiff",
      "desc": "A wooden hull the size of a rowing boat, held aloft by a single levitation crystal and steered by a tiller. She carries two people and their belongings, she handles like a dream in calm air, and she drops like a stone when the crystal cracks.",
      "notes": "The sky skiff is your personal transport and your chase vehicle. She's fast, agile, and carries almost nothing. Use her for aerial pursuits through canyon systems, city spires, and floating rock formations where larger vessels can't follow.",
      "image": "",
      "size": 3,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -3,
      "armourLevel": -4,
      "speedLevel": 2,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Cloud Cutter",
      "desc": "A sleek single-masted vessel that cuts through cloud banks at speed, running cargo and passengers between sky-ports. She's fast, lightly armed, and the preferred vessel of smugglers, couriers, and anyone who values speed over comfort.",
      "notes": "The cloud cutter is your light freighter of the skies. She carries enough cargo to turn a profit and enough speed to outrun trouble. Use her as the starting vessel for a sky-piracy or trading campaign. She's the Millennium Falcon with sails.",
      "image": "",
      "size": 6,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -1,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Sky Brig",
      "desc": "Two masts, a broadside of four light cannons per side, and enough crew to board an enemy vessel. She's the workhorse of every sky-navy and the backbone of every pirate fleet. Not the fastest, not the toughest, but always available and always reliable.",
      "notes": "The sky brig is your all-purpose warship. She fights, she patrols, she escorts merchants. She's the default encounter vessel — whoever the players meet in the sky lanes, they're probably flying a brig. Give her to NPCs who need a credible threat without overwhelming the party.",
      "image": "",
      "size": 10,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "War Galleon (Sky)",
      "desc": "The heavy warship of the sky lanes. Three masts, twenty guns, and a hull reinforced with iron bands that can absorb broadsides that would splinter a brig. She commands the sky through sheer firepower and the knowledge that nothing short of another galleon can stand against her.",
      "notes": "The sky war galleon is your set-piece battle vessel. She appears when the stakes are high — fleet actions, royal escorts, pirate-hunting expeditions. The players either serve aboard one, fight alongside one, or spend the campaign avoiding one.",
      "image": "",
      "size": 14,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "bombs_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Dwarven Ironclad (Sky)",
      "desc": "Iron hull, steam engine, and guns that fire shells rather than shot. The dwarves build their sky-vessels the way they build everything — heavy, over-engineered, and completely contemptuous of elvish aesthetics. She's ugly, she's slow, and she shrugs off cannonballs like rain.",
      "notes": "The ironclad changes the tactical equation. Conventional cannons bounce off her hull — the players need incendiary weapons, boarding actions, or attacks on her engine to disable her. Use her to introduce the arms race between wood and iron.",
      "image": "",
      "size": 12,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_mod",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 4,
      "armourLevel": 3,
      "speedLevel": -3,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Observation Balloon",
      "desc": "A gas bag, a basket, and a telescope. She doesn't move under her own power — she's tethered to a ground position or a ship and rises to a height where her observer can see for miles. Simple, fragile, and invaluable.",
      "notes": "The observation balloon is your aerial scouting tool for armies that can't afford sky-ships. She provides intelligence — enemy positions, fleet movements, weather patterns. Shooting her down blinds the enemy. Protecting her keeps your side informed.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -3,
      "armourLevel": -4,
      "speedLevel": -5,
      "handlingLevel": -4,
      "woundsLevel": 0
    },
    {
      "name": "Transport Barge (Sky)",
      "desc": "Flat-bottomed, wide-beamed, and capable of carrying cargo that would sink a cloud cutter. She hauls supplies, building materials, livestock, and entire households between sky-ports. She's not armed, she's not fast, and the entire sky-economy depends on her.",
      "notes": "The transport barge is your escort mission. She carries something valuable and she can't protect herself. Every pirate in the sky lanes wants her cargo. The players guard her, and every encounter is a rearguard action against faster, more agile attackers.",
      "image": "",
      "size": 12,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": -1,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Elven Windrunner",
      "desc": "Grown rather than built — a living vessel of shaped wood and bound air elementals. She's fast beyond reason, she heals her own damage given time, and she responds to her captain's will rather than to rudder and sail. She is, in every sense, alive.",
      "notes": "The windrunner is your exotic high-end vessel. She's faster than anything else in the sky and her self-repair makes her sustainable over long campaigns. Use her as the prize vessel — the players earn one, capture one, or desperately need one. Her bonded nature means she chooses her captain.",
      "image": "",
      "size": 8,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -2,
      "speedLevel": 2,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Bomber Dirigible",
      "desc": "A massive gas envelope carrying a gondola loaded with alchemical bombs. She flies high, above the range of most shipboard weapons, and drops her payload on surface targets. She's slow, she's vulnerable to incendiary attack, and she's terrifying from below.",
      "notes": "The bomber dirigible is your strategic air weapon. She devastates ground targets — fortresses, harbours, armies on the march. Her vulnerability is fire: one incendiary arrow into the gas bag and she's a torch. Use her for bombing raids the players must intercept, or as the weapon they deploy against an impregnable fortress.",
      "image": "",
      "size": 14,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "bombs_ww",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": -2,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Royal Flagship (Sky)",
      "desc": "The monarch's vessel. Gold leaf on the hull, enchantments in the keel, and weapons that fire bolts of crystallised lightning. She exists to project royal authority across the sky — equal parts warship, palace, and symbol. She is the throne, airborne.",
      "notes": "The royal flagship is your campaign set-piece. She appears for coronations, declarations of war, and the final battle. She's the most powerful vessel in the kingdom and she carries the sovereign aboard. Attack her and you've declared war. Defend her and you've saved the realm.",
      "image": "",
      "size": 16,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_mod",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    }
  ]
}