{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Sails & Gasbags — Fantasy Skyfleet",
  "packId": "fantasy_skyfleet",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Sky Cutter",
      "desc": "A fast patrol vessel with a single mast and a crystalline keel that hums with levitation magic. She runs messages between sky-ports, intercepts smugglers, and chases pirates through cloud banks. Light enough to manoeuvre through storm fronts that ground heavier ships.",
      "notes": "The sky cutter is your patrol and pursuit vessel. She's fast and nimble in the tight spaces between floating islands and storm walls. Use her for chase encounters where the terrain — clouds, updrafts, lightning — is as dangerous as the enemy.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "light_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "swivel_gun",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -2,
      "armourLevel": -2,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Cloud Galleon",
      "desc": "The merchant queen of the sky lanes. Three masts of enchanted silk, a hull of iron-banded oak, and a cargo hold large enough to supply an entire sky-port for a season. She carries wealth that makes her a target and enough guns to remind pirates of the fact.",
      "notes": "The cloud galleon is your high-value target and your campaign base for merchant campaigns. She carries enough cargo to make every voyage profitable and enough crew to make boarding her a serious fight. Losing one disrupts the economy of an entire region.",
      "image": "",
      "size": 14,
      "loco": "water_sail",
      "mods": {},
      "weapons": [
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "swivel_gun",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "War Zeppelin",
      "desc": "A rigid-frame dirigible the size of a castle, carrying broadside batteries in gondolas slung beneath the gas envelope. She's slow, she's enormous, and she dominates the airspace above her through sheer volume of fire. Nothing flies near her without permission.",
      "notes": "The war zeppelin is your aerial fortress. She controls a volume of sky through overlapping fields of fire. Use her as the centrepiece of a defensive fleet or the anchor of an invasion force. Her weakness is fire — one good hit to the gas cells and she burns spectacularly.",
      "image": "",
      "size": 16,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "bombs_ww",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Sky Skiff",
      "desc": "Barely more than a plank with a levitation rune and a prayer. She carries one or two people at reckless speed through gaps that proper vessels would never attempt. Racers, messengers, and lunatics love them equally.",
      "notes": "The expansion sky skiff is your racing and courier vehicle. She's faster than the starter version and even more fragile. Use her for races through obstacle courses, desperate message runs, and the moment when the players need to reach something faster than any proper ship can manage.",
      "image": "",
      "size": 3,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -3,
      "armourLevel": -4,
      "speedLevel": 2,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Dwarven Ironclad",
      "desc": "Riveted iron plates over a steel frame, driven by a coal-fired engine that belches black smoke across the sky. She doesn't glide — she hammers through the air by force of engineering. The dwarves don't trust magic to keep them aloft. They trust iron.",
      "notes": "The expansion ironclad is heavier and better armed than the starter version. Her steam engine means she doesn't depend on wind or magic, which makes her reliable in conditions that ground sail-powered vessels. Use her to show the industrialisation of sky warfare.",
      "image": "",
      "size": 12,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 4,
      "armourLevel": 4,
      "speedLevel": -3,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Elven Windrunner",
      "desc": "A living ship of shaped heartwood, bonded to an air elemental that serves as engine and navigator. She moves with the wind because the wind moves for her. She's the fastest vessel in any sky, and she answers only to the captain the elemental has chosen.",
      "notes": "The expansion windrunner is the premium vessel. She out-performs everything and her living hull repairs itself. Use her as the prize — the vessel that an elven lord arrives in, or that the players spend a campaign earning the right to captain.",
      "image": "",
      "size": 10,
      "loco": "water_sail",
      "mods": {},
      "weapons": [
        {
          "weaponId": "bow_battery",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -2,
      "armourLevel": -2,
      "speedLevel": 2,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Pirate Sky-Brig",
      "desc": "A standard brig modified for raiding — extra speed from stripped-down weight, grappling hooks and boarding planks mounted at every rail, and a crew of cutthroats who fight like cornered rats. She flies a black flag and everyone knows what it means.",
      "notes": "The pirate brig is your recurring antagonist vessel. She attacks, she boards, she loots, and she vanishes into a cloud bank before the navy arrives. Use her for the pirate captain who becomes the campaign's nemesis — a named ship with a named crew.",
      "image": "",
      "size": 10,
      "loco": "water_sail",
      "mods": {},
      "weapons": [
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "swivel_gun",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Goblin Balloon Bomb",
      "desc": "A sack of volatile gas, a basket of goblin engineers, and enough alchemical explosives to level a city block. She's steered — loosely — by venting gas in the general direction of the target. The goblins consider a fifty percent survival rate an acceptable mission success.",
      "notes": "The goblin balloon bomb is your comedy weapon and your genuine threat. She's ridiculous and she's lethal. Use her for goblin encounters where the absurdity of the delivery system doesn't diminish the danger. The goblins are enthusiastic, expendable, and completely unconcerned about safety.",
      "image": "",
      "size": 4,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "bombs_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -4,
      "armourLevel": -5,
      "speedLevel": -1,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Royal Flagship (Sky)",
      "desc": "The throne ship. Enchanted hull, crystal-powered weapons, wards that deflect hostile magic, and quarters fit for a sovereign. She carries the monarch across the sky in comfort and safety, accompanied by an honour guard of war galleons. She is the symbol of the realm's power.",
      "notes": "The expansion royal flagship is the ultimate sky vessel. She's the campaign's most powerful ship and the one the players must protect or capture to win. Use her for climactic battles — whoever controls the flagship controls the sky.",
      "image": "",
      "size": 18,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 3,
      "armourLevel": 2,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Dragon-Rider Platform",
      "desc": "Not a ship at all — a harness and fighting platform strapped to the back of a trained dragon. The rider directs the beast while archers or mages mounted behind provide ranged support. She's the most mobile and most terrifying air unit in any sky fleet.",
      "notes": "The dragon platform is your ultimate air superiority unit. She's faster than ships, more agile, and the dragon's breath weapon is devastating. Use her as the ace — one dragon-rider can turn a battle. The dragon's temperament is the complication: she's a living creature, not a machine, and she has opinions.",
      "image": "",
      "size": 8,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "bow_battery",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -1,
      "speedLevel": 0,
      "handlingLevel": 1,
      "woundsLevel": 0
    }
  ]
}