{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Sails & Gasbags — Skyship Starter",
  "packId": "skyship_starter",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "note": "Core weapons only. For buoyancy, gas cell vulnerability, aerial boarding, and altitude weather rules, see the full Sails & Gasbags supplement.",
  "vehicles": [
    {
      "name": "Sky Skiff",
      "desc": "A rowing boat that flies. Open-topped, wind-blasted, and carrying two to four crew who hang on with white knuckles. She's the dinghy of the sky — small enough to dock on a rooftop, fast enough to outrun a galleon, and fragile enough that a crossbow bolt through the levitation crystal ends the conversation permanently.",
      "notes": "The sky skiff is your starter vessel and your ship's boat. She scouts, she ferries, and she provides the dramatic moment when the players leap from the mother ship in a skiff to board the enemy. One hit to the levitation system and she's falling, not flying.",
      "image": "",
      "size": 3,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -3,
      "armourLevel": -4,
      "speedLevel": 2,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Cloud Cutter",
      "desc": "A sleek, fast vessel built for speed above all else. She cuts through cloud banks like a knife, outruns anything heavier, and carries just enough guns to make pirates think twice. The smuggler's friend and the customs officer's nemesis.",
      "notes": "The cloud cutter is your chase vessel. She wins speed-based encounters against anything her size or larger. Use her for smuggling, courier runs, and blockade evasion. Her light armament means she can't stand and fight — she has to keep moving or die.",
      "image": "",
      "size": 6,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -1,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Sky Brig",
      "desc": "Two masts, fore-and-aft rigged for the sky winds, and a broadside of six cannons per side. She's the workhorse of every sky navy and pirate fleet — big enough to fight, fast enough to patrol, and cheap enough to build in numbers.",
      "notes": "The sky brig is your campaign vessel. She's the right size for a party — everyone has a role, the ship feels personal, and the stakes are high enough that losing her matters. Everything in the sky is measured relative to the brig.",
      "image": "",
      "size": 10,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "War Galleon (Sky)",
      "desc": "A converted surface galleon held aloft by massive levitation arrays. She's heavy, she's slow, and she carries enough guns to demolish a fortress. The war galleon is the ship of the line for sky navies — she doesn't chase, she dominates the airspace she occupies.",
      "notes": "The war galleon is your set-piece combatant. She appears for major battles, convoy escorts, and siege support. Her guns outrange everything smaller. The players fight from her deck during fleet actions or flee from her when they've made powerful enemies.",
      "image": "",
      "size": 14,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "bombs_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Dwarven Ironclad (Sky)",
      "desc": "Metal hull, steam engines, and the stubborn engineering philosophy that if something can be reinforced, it should be reinforced twice. She's slow, she's heavy, and enemy fire bounces off her like rain off granite. The dwarves don't build fast ships. They build ships that survive.",
      "notes": "The dwarven ironclad is your tank in the sky. She absorbs punishment that would splinter wooden vessels. Her steam engines mean she doesn't need wind, which is a tactical advantage when the weather changes. Use her as an allied asset or a terrifying opponent that the players can't hurt from range.",
      "image": "",
      "size": 12,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_mod",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 4,
      "armourLevel": 3,
      "speedLevel": -3,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Observation Balloon",
      "desc": "A basket, a gasbag, and a tether line. She rises above the battlefield and her crew watches the enemy's movements, directing artillery and flagging ambushes. She can't move, she can't fight, and she sees everything.",
      "notes": "The observation balloon is your intelligence asset. She provides overhead surveillance that changes the tactical picture — no surprises, no hidden flanking manoeuvres. But she's tethered and defenceless. Shooting her down is easy. Protecting her while she does her job is the adventure.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -3,
      "armourLevel": -4,
      "speedLevel": -5,
      "handlingLevel": -4,
      "woundsLevel": 0
    },
    {
      "name": "Transport Barge (Sky)",
      "desc": "A flat-bottomed cargo vessel held aloft by rows of levitation crystals. She carries supplies, troops, livestock, and everything else an army or colony needs. She's not fast, she's not armed, and she's the most important vessel in any fleet that plans to be somewhere for more than a day.",
      "notes": "The transport barge is your escort mission. She carries something irreplaceable and she can't protect herself. The players guard her through pirate territory, storm fronts, and mountain passes too narrow for comfort. If she goes down, the cargo goes with her.",
      "image": "",
      "size": 12,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": -1,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Elven Windrunner",
      "desc": "Grown rather than built. Living wood shaped by decades of patient cultivation into a hull that responds to the wind like a living thing. She's fast, she's silent, and she moves through cloud banks with an organic grace that makes human shipwrights weep with envy.",
      "notes": "The windrunner is your exotic allied vessel. She's faster than anything human-built in natural wind, but she can't be repaired with conventional materials — she heals slowly, like a living thing. Use her for elven NPC encounters or as a prize the players can't easily maintain.",
      "image": "",
      "size": 8,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -2,
      "speedLevel": 2,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Bomber Dirigible",
      "desc": "A rigid airship carrying bombs in an internal bay. She flies high above the battlefield, drops her payload on fortifications and formations below, and relies on altitude to keep her safe from return fire. She's the strategic bomber of the fantasy sky war.",
      "notes": "The bomber dirigible is your area bombardment asset. She devastates fixed positions but she's vulnerable to fast interceptors that can reach her altitude. Use her for siege scenarios where the defenders need air support — or where the attackers bring one and the players need to stop it.",
      "image": "",
      "size": 14,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "bombs_ww",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": -2,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Royal Flagship (Sky)",
      "desc": "Gold leaf, enchanted timber, and guns that glow with arcane fire. She's the monarch's personal vessel — more symbol than warship, but a symbol that can reduce a city to rubble. Her crew are the elite of the sky navy, and her captain answers only to the throne.",
      "notes": "The royal flagship is your campaign set-piece. She appears for coronations, fleet reviews, and the final battle of the war. She should have a name, a history, and a reputation that precedes her. If the players serve aboard her, they're part of something legendary.",
      "image": "",
      "size": 16,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_mod",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    }
  ]
}