{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Dread & Ruin — Haunted Vehicles",
  "packId": "haunted_vehicles",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Death Coach",
      "desc": "The Cóiste Bodhar of Irish legend. She arrives for the dying, drawn by a headless horseman who carries his own head under one arm. If she stops at your door, someone inside will not see the morning. Her arrival is not a warning. It is a certainty.",
      "notes": "The expansion death coach is the folklore version — more specific, more terrifying. The headless driver is a dullahan, a powerful undead foe. She doesn't just collect the dead; she causes death by speaking the victim's name. The players must stop her before she speaks.",
      "image": "",
      "size": 5,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Ghost Ship",
      "desc": "Not one specific vessel but the archetype — the Mary Celeste, the Octavius, the Baychimo. She's found adrift with no crew, no explanation, and food still warm on the table. Whatever happened aboard happened quickly and left nothing behind except questions.",
      "notes": "The expansion ghost ship is the mystery variant. She's not actively hostile — she's a puzzle. The players board her to determine what happened to the crew. Each clue deepens the mystery and the horror. The ship remembers what happened and replays it in fragments.",
      "image": "",
      "size": 16,
      "loco": "water_sail",
      "mods": {},
      "weapons": [
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 0,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Possessed Automobile",
      "desc": "She rolled off the assembly line with something already inside her. Not a ghost, not a demon — something that lives in the engine block and the wiring and the steel. She bonds with her owner and destroys anyone who threatens them. She loves, in her way. It's a terrible love.",
      "notes": "The expansion automobile has a personality. She's protective of her owner, jealous of rivals, and murderous toward threats. The horror is emotional — the owner loves the car, the car loves the owner, and people keep dying. The players must convince the owner to let go.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Soul Engine Train",
      "desc": "A midnight express that runs on a track that doesn't appear on any map. She collects passengers at unmarked stations — people who stepped onto the platform by accident, by desperation, or by invitation. The conductor punches tickets that never expire.",
      "notes": "The expansion soul train is the afterlife express. Each carriage represents a different stage of judgement. The players ride through, encountering echoes of the dead who are being processed. The destination is the final judgement — and the players aren't dead yet, which causes problems.",
      "image": "",
      "size": 12,
      "loco": "tracked",
      "mods": {},
      "weapons": [],
      "toughLevel": 3,
      "armourLevel": 1,
      "speedLevel": 2,
      "handlingLevel": -5,
      "woundsLevel": 0
    },
    {
      "name": "Bone Chariot",
      "desc": "Not merely bones assembled into a vehicle — the bones of a specific person, shaped by necromantic will into a chariot that carries their murderer. She is revenge made manifest, and she will not stop until the debt is paid.",
      "notes": "The expansion bone chariot is personal. She hunts a specific NPC — the person who killed the bones' original owner. The players are caught in the middle: the NPC claims innocence, the chariot disagrees, and the truth is more complicated than either side admits.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Cursed Submarine",
      "desc": "A U-boat lost in 1943 that surfaces in modern waters with her crew still at their stations. The crew are perfectly preserved, perfectly alive, and perfectly convinced that the war is still being fought. They will torpedo anything that flies an Allied flag.",
      "notes": "The expansion submarine is the time-displacement variant. The crew are human, not undead — they're confused and frightened, not evil. The horror is the tragedy: they can't go home, they can't accept what's happened, and the players have to decide what to do with eighty men who've been dead for decades.",
      "image": "",
      "size": 10,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "torpedo_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Infernal War Machine",
      "desc": "A siege engine built in the foundries of Hell, armoured with the skins of the damned, and powered by the suffering of its captive souls. She crossed into the mortal world through a breach in the veil and she's looking for a way back — through whatever stands between her and the gate.",
      "notes": "The expansion infernal war machine is on a mission. She's not random — she's heading toward a specific location for a specific reason. The players must stop her before she reaches the breach point, or the gate opens wider and more come through. She's a ticking clock made of iron and damnation.",
      "image": "",
      "size": 8,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 3,
      "armourLevel": 2,
      "speedLevel": 1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Flying Dutchman",
      "desc": "Captain Vanderdecken's vessel, cursed by God to sail until Judgement Day. She appears before every storm, her crew reach out to passing ships begging for news of a world that's moved on without them, and anyone who accepts a letter from the Dutchman's crew is cursed to join them.",
      "notes": "The expansion Dutchman is the sympathetic version. The captain is trapped, not malicious. The players can break the curse — but the price is terrible and the method requires entering the ship's domain, where time moves differently and the dead crew want desperately to be alive again.",
      "image": "",
      "size": 18,
      "loco": "water_sail",
      "mods": {},
      "weapons": [
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 4,
      "armourLevel": 2,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Hearse of the Damned",
      "desc": "A Victorian hearse pulled by black horses whose hooves strike no sparks. She collects bodies that were buried in unsanctified ground — criminals, suicides, the excommunicated — and carries them to wherever such souls are processed. The undertaker driving her has been doing this since 1888.",
      "notes": "The expansion hearse is the collector of the forgotten dead. She appears when someone who died in sin is buried. The players encounter her when a recently deceased NPC — perhaps a friend — is on her list. Stopping her means confronting the undertaker, who is ancient, polite, and vastly more powerful than he appears.",
      "image": "",
      "size": 5,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Witch's Hut (Walking)",
      "desc": "She stands on two enormous chicken legs, each the size of a tree trunk, and she walks. Through forests, across rivers, over mountains. She obeys the crone inside — the original crone, the one the stories are about — and she has been walking since before anyone can remember.",
      "notes": "The expansion walking hut is Baba Yaga's actual home. She's an artefact-level entity with her own intelligence and agenda. The hut tests visitors with riddles, traps, and challenges before allowing access to the witch. The players who pass the tests get what they came for. Those who fail become part of the hut.",
      "image": "",
      "size": 6,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    }
  ]
}