{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Dread & Ruin — Horror Starter",
  "packId": "horror_starter",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "note": "Basic stat blocks only. For possession, vehicle malice, cursed vehicles, sentient vehicles, and soul engines, see the full Dread & Ruin supplement.",
  "vehicles": [
    {
      "name": "Death Coach",
      "desc": "A black carriage drawn by spectral horses, arriving uninvited at the homes of the dying. No driver is visible, but the door opens when she stops, and something inside is waiting. She has come for a passenger. She always leaves with one.",
      "notes": "The death coach is your omen and your countdown timer. She appears before a death, which means the players see her and know someone is about to die — but not who. She can't be stopped by physical means. Destroying her just means she rebuilds herself the next night.",
      "image": "",
      "size": 5,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Ghost Ship",
      "desc": "She sails without wind, without crew, and without destination. Her hull is encrusted with barnacles from centuries of drifting, her rigging hangs in tatters, and the lights that flicker in her cabin windows are not lanterns. She approaches other vessels in fog and what happens next depends on what she wants.",
      "notes": "The ghost ship is your maritime horror encounter. She appears from fog, she can't be outrun, and boarding her is a descent into a haunted location that follows nautical logic — flooded decks, locked cabins, something in the hold. The ship herself is the dungeon.",
      "image": "",
      "size": 16,
      "loco": "water_sail",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 0,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Possessed Car",
      "desc": "A vehicle with a mind of its own — and that mind is hostile. She starts her engine without keys, locks her doors with passengers inside, and accelerates toward whatever her occupants fear most. She's not broken. She's awake.",
      "notes": "The possessed car turns a mundane object into a trap. The players are inside when she comes alive. Steering doesn't respond, brakes don't work, doors are locked. Use her for a contained horror scenario where the vehicle itself is the monster and the players have to find a way out at speed.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Soul Engine Train",
      "desc": "A locomotive that burns souls instead of coal. She runs on tracks that don't appear on any map, arriving at stations that exist only in nightmares. Her whistle sounds like screaming. Her passenger cars are full — but the passengers never disembark.",
      "notes": "The soul engine is your vehicle-as-location. The players board the train and can't get off — the doors are sealed, the windows show impossible landscapes, and the other passengers are hollow-eyed and silent. The adventure is reaching the engine and stopping whatever drives it.",
      "image": "",
      "size": 12,
      "loco": "tracked",
      "mods": {},
      "weapons": [],
      "toughLevel": 3,
      "armourLevel": 1,
      "speedLevel": 2,
      "handlingLevel": -5,
      "woundsLevel": 0
    },
    {
      "name": "Bone Chariot",
      "desc": "Assembled from the bones of the dead, pulled by skeletal horses, and driven by a revenant warrior who died before he finished his war. She's a necromantic war machine — every bone in her frame was someone's ancestor, and they're all angry about it.",
      "notes": "The bone chariot is your undead cavalry vehicle. She charges into the living, tramples formations, and the driver fights from the platform with weapons forged from grave iron. Destroying the chariot scatters the bones — but unless the binding spell is broken, she reassembles by midnight.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Infernal War Machine",
      "desc": "Forged in a hell dimension from iron that screams when struck. She's powered by trapped souls, armed with weapons that burn with hellfire, and crewed by demons who consider traffic laws a quaint mortal concept. She drives through reality like a hot knife through butter.",
      "notes": "The infernal war machine is your demon vehicle. She ignores conventional damage, passes through solid matter, and her weapons cause supernatural wounds. The players can't fight her conventionally — they need holy weapons, binding rituals, or the name of the demon that drives her.",
      "image": "",
      "size": 8,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 3,
      "armourLevel": 2,
      "speedLevel": 1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Flying Dutchman",
      "desc": "Doomed to sail forever, never reaching port. She appears in storms, her captain standing at the bow, cursed to roam the seas until the end of time. Ships that answer her hail find their compasses spinning, their charts useless, and their destination unreachable.",
      "notes": "The Flying Dutchman is your nautical curse scenario. Meeting her isn't a fight — it's a puzzle. She wants something: a message delivered, a wrong righted, a descendant found. If the players help her, the curse breaks. If they ignore her, their own navigation becomes unreliable until they return.",
      "image": "",
      "size": 18,
      "loco": "water_sail",
      "mods": {},
      "weapons": [],
      "toughLevel": 4,
      "armourLevel": 2,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Hearse of the Damned",
      "desc": "A funeral vehicle that collects passengers who aren't dead yet. She pulls up outside the homes of the living, her driver opens the rear door, and the coffin inside is empty — but it has a name plate. Your name.",
      "notes": "The hearse is your personal horror vehicle. She targets a specific player character, appearing at midnight with their name on the coffin. The adventure is finding out why the hearse has chosen them and how to redirect or destroy it before it completes its collection.",
      "image": "",
      "size": 5,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Cursed Submarine",
      "desc": "She sank with all hands during the war and she's still down there — but she's not empty. Her dead crew continues their patrol, torpedoing vessels that cross their route, adding new ghosts to the complement with every kill. She's been sinking ships for decades and no one knows why.",
      "notes": "The cursed submarine combines ghost ship horror with submarine claustrophobia. She attacks shipping, then vanishes to the deep. The players must find her wreck, board her, and deal with a crew that doesn't know they're dead — or doesn't care.",
      "image": "",
      "size": 10,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "torpedo_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Witch's Hut",
      "desc": "A crude wooden hut on two enormous chicken legs. She stands up, she walks through the forest, and she carries her occupant — a crone of terrifying power — to wherever the crone needs to be. She's not a vehicle in any engineering sense. She's a fairy tale that refused to stay in the book.",
      "notes": "Baba Yaga's hut is your comic horror vehicle. She's absurd, she's terrifying, and she walks through the forest knocking down trees. The hut has a personality — she's cranky, she doesn't like strangers, and she might refuse to go where the players want. Treat her as an NPC with four legs and a bad attitude.",
      "image": "",
      "size": 6,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    }
  ]
}