{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Dread & Ruin — Haunted Vehicles",
  "packId": "haunted_vehicles",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Death Coach",
      "desc": "The Cóiste Bodhar of Irish folklore. Silent wheels, headless horses, and a driver who carries his own skull under one arm. She arrives at the house of the dying and waits. If you speak to the driver, he throws a basin of blood in your face. She cannot be turned away.",
      "notes": "This variant emphasises folklore over generic horror. The death coach follows specific rules — she can't cross running water, she arrives only at night, and iron horseshoes on the door delay her. Use these folk protections as puzzle elements the players must discover.",
      "image": "",
      "size": 5,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Ghost Ship",
      "desc": "She burns on the horizon every anniversary of her sinking. The fire doesn't consume her — it repeats, endlessly, the night she went down with all hands. Fishermen who approach find their nets full of bones and their compasses pointing toward the wreck.",
      "notes": "This variant is the anniversary ghost — she appears on a specific date and replays her destruction. The players witness the sinking and must intervene in the ghostly replay to change the outcome and break the cycle. Time-loop horror on the open water.",
      "image": "",
      "size": 16,
      "loco": "water_sail",
      "mods": {},
      "weapons": [
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 0,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Possessed Automobile",
      "desc": "She rolled off the assembly line hungry. Something attached itself to the chassis before the paint dried — something that feeds on fear, on speed, on the sound of impact. She doesn't just crash. She hunts.",
      "notes": "This variant is the intelligent predator vehicle. She manipulates her owners — starting easily, running smoothly, building trust — then she kills. The investigation reveals a trail of 'accidents' going back to the factory. The players must destroy her, but she's aware of the threat and fights back.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Soul Engine Train",
      "desc": "Built by a railroad magnate who made a deal with something that shouldn't have been bargained with. The locomotive runs on suffering — each soul burned gives her a hundred miles of track. She's been running for a century and her fuel supply shows no sign of exhaustion.",
      "notes": "This variant has a corporate horror angle. The train was built deliberately, not cursed accidentally. Someone made a knowing bargain. The players trace the history back to the original deal and must find a way to break the contract — which means confronting whatever was on the other side of the bargain.",
      "image": "",
      "size": 12,
      "loco": "tracked",
      "mods": {},
      "weapons": [],
      "toughLevel": 3,
      "armourLevel": 1,
      "speedLevel": 2,
      "handlingLevel": -5,
      "woundsLevel": 0
    },
    {
      "name": "Bone Chariot",
      "desc": "Reconstructed from the ossuaries of a desecrated church, she was built as a weapon of revenge by a necromancer whose congregation was massacred. Every bone remembers who it was, and every bone wants justice. She's not evil. She's furious.",
      "notes": "This variant has a sympathetic backstory. The chariot and its driver have a legitimate grievance — their people were murdered and their bones desecrated. The players must decide whether to destroy the chariot or help it achieve justice, knowing that its methods are monstrous even if its cause is righteous.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Cursed Submarine",
      "desc": "U-471. Lost with all hands in the North Atlantic, 1943. She was carrying something in her forward torpedo room that wasn't a torpedo — something the Ahnenerbe recovered from a temple in occupied France. The crew died. The cargo woke up.",
      "notes": "This variant combines WWII history with occult horror. The submarine carries an artefact that animates the dead crew. The players discover the wreck, board her, and must deal with both the undead crew and the artefact that controls them. Destroying the sub doesn't help — the artefact survives.",
      "image": "",
      "size": 10,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "torpedo_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Infernal War Machine",
      "desc": "A tank forged in the furnaces of a hell dimension, crewed by soldiers who sold their souls for victory in a war they've long since forgotten. She breaks through from the other side during thin moments — eclipses, solstices, sites of mass death — and the things she kills join her crew.",
      "notes": "This variant is a dimensional incursion vehicle. She appears at weakened points in reality and fights until the breach closes. The players must either survive until dawn, seal the breach, or find a way to send her back. Every person she kills makes her crew stronger.",
      "image": "",
      "size": 8,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 3,
      "armourLevel": 2,
      "speedLevel": 1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Flying Dutchman",
      "desc": "Captain Hendrick van der Decken swore he would round the Cape if it took him until Judgement Day. Something heard him and took him literally. Four hundred years later, his ship still rounds the Cape, and every vessel that sees her light is drawn into her wake.",
      "notes": "This variant uses the historical legend directly. Van der Decken is a character — cursed, ancient, and desperate for release. The players can bargain with him, fight him, or try to break his curse. Breaking it requires finding something specific — a willing sacrifice, a holy relic, or an act of genuine compassion.",
      "image": "",
      "size": 18,
      "loco": "water_sail",
      "mods": {},
      "weapons": [
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "med_cannon_bp",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 4,
      "armourLevel": 2,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Hearse of the Damned",
      "desc": "Operated by a funeral home that's been in business since 1887. The current director doesn't know why some clients arrive alive. He doesn't ask. The hearse knows where to go, the driver follows, and the coffins in the back are always the right size.",
      "notes": "This variant adds a mundane conspiracy layer. The funeral home is real, the director is human, and he's been complicit for decades because the hearse makes his business profitable. The players investigate the funeral home as a mundane mystery that turns supernatural when they follow the hearse at midnight.",
      "image": "",
      "size": 5,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Witch's Hut (Walking)",
      "desc": "Larger than the starter variant. This is the full Baba Yaga experience — a two-storey izba on legs thick as tree trunks, surrounded by a fence of human bones, with a skull on every post that glows with foxfire. She walks through the forest and the forest gets out of her way.",
      "notes": "The full walking hut is a location and a vehicle simultaneously. Inside is the witch's home — rooms that are larger than the exterior suggests, shelves of impossible ingredients, and a fireplace that talks. The hut defends itself, which means the players fight a building. Use her as a mobile dungeon that shows up uninvited.",
      "image": "",
      "size": 6,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    }
  ]
}