{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Saddle & Fang — Mount Starter",
  "packId": "mount_starter",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "note": "Basic stat blocks only. For mount temperament, breath weapons, living vehicle HP, panic rules, and mounted combat, see the full Saddle & Fang supplement.",
  "vehicles": [
    {
      "name": "Warhorse",
      "desc": "Bred for battle, trained to charge into spear walls without flinching, and heavy enough to knock an armoured man flat. The warhorse is the foundation of cavalry warfare — without her, knights are just expensive infantry.",
      "notes": "The warhorse is your baseline mount. She provides Pace, charge bonuses, and an elevated fighting position. She also panics under fire, throws riders, and dies to a lucky spear thrust — all of which create dramatic moments. Losing a warhorse mid-battle changes everything.",
      "image": "",
      "size": 3,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Giant Eagle",
      "desc": "Twenty-foot wingspan, talons that crush plate armour, and an intelligence that borders on sapient. She's not a mount — she's a partner who tolerates being ridden because the arrangement suits her purposes. She has opinions about where she flies and they don't always align with the rider's.",
      "notes": "The giant eagle is your aerial mount with personality. She's smart enough to refuse stupid orders, which means the player doesn't always get to choose the approach vector. Her talons are weapons in their own right — she fights alongside the rider, not just under them.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -4,
      "speedLevel": 2,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Griffin",
      "desc": "Lion body, eagle head, and the disposition of both. She's fiercely territorial, fiercely loyal to her bonded rider, and fiercely willing to eat anyone who isn't the bonded rider. Training a griffin is a lifetime commitment. So is failing to train one.",
      "notes": "The griffin combines ground and air capability. She fights on the ground with lion claws and in the air with eagle speed. The bonding mechanic is the hook — she won't accept another rider, which means if the player dies, the griffin is lost to the party.",
      "image": "",
      "size": 6,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Dragon (Young)",
      "desc": "Barely mature, still growing, and already more dangerous than anything else in the sky. A young dragon is a weapon that hasn't finished becoming a weapon. She breathes fire — or ice, or lightning — and she considers her rider a useful accessory, not a master.",
      "notes": "The young dragon is your prestige mount. She's powerful but wilful — Spirit checks to control her in stressful situations. A dragon that decides to chase prey instead of following orders creates chaos that's entirely in keeping with the source material. She's an ally, not a tool.",
      "image": "",
      "size": 10,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Dire Wolf",
      "desc": "Shoulder-high and built like a siege engine covered in fur. She hunts in packs, she fights with coordinated intelligence, and she carries a rider who understands that the wolf's instincts are usually better than human tactics.",
      "notes": "The dire wolf is your ground-based predator mount. She tracks by scent, fights with bite attacks, and her pack instincts mean multiple dire wolves coordinate automatically. Use her for ranger and barbarian characters who want a mount that feels wild rather than domesticated.",
      "image": "",
      "size": 4,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -3,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Wyvern",
      "desc": "Smaller than a dragon, meaner than a griffin, and carrying a venomous tail stinger that paralyses anything it hits. She's the economy dragon — less intelligent, less prestigious, and considerably more willing to sting her own rider if she's in a bad mood.",
      "notes": "The wyvern is your budget flying mount. She's easier to acquire than a dragon but harder to control — less intelligent means less reasoning and more animal instinct. The tail stinger adds a poison attack that the rider can direct. She's volatile and rewarding in equal measure.",
      "image": "",
      "size": 7,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": -1,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "War Elephant",
      "desc": "Twelve feet tall, eight tons, and carrying a fortified howdah with room for archers and a mahout who controls her with voice commands and a hooked goad. She tramples infantry, terrifies horses, and occasionally decides that she's had enough and stampedes through both armies.",
      "notes": "The war elephant is your mobile platform. The howdah carries multiple characters — a mahout, archers, a commander. She's devastating on the charge but her morale is her weakness. Loud noises, fire, and pain can trigger a stampede that hurts allies as much as enemies.",
      "image": "",
      "size": 8,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 3,
      "armourLevel": -1,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Giant Spider",
      "desc": "Eight legs, vertical mobility, and the ability to produce webbing that can anchor a bridge, trap a corridor, or bind an enemy in seconds. She climbs walls, she crosses ceilings, and she moves through terrain that stops every other mount dead.",
      "notes": "The giant spider goes where nothing else can — vertical surfaces, ceilings, narrow passages. She's the drow mount, the underdark scout, and the nightmare of anyone with arachnophobia at the table. Her webbing is a utility tool as much as a weapon.",
      "image": "",
      "size": 4,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 0,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Triceratops",
      "desc": "Three horns, a bony frill that stops most weapons, and the temperament of a rhinoceros crossed with a bulldozer. She charges in a straight line and nothing in that line survives. She's not fast, she's not agile, and she doesn't need to be.",
      "notes": "The triceratops is your living battering ram. Her charge attack is devastating — she hits like a vehicle collision because she essentially is one. The frill provides natural armour that covers the rider from frontal attacks. Use her for shock assault and fortification breaching.",
      "image": "",
      "size": 8,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 3,
      "armourLevel": 1,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Pegasus",
      "desc": "A winged horse of celestial grace. She flies without effort, she fights without fear, and she bonds with riders whose hearts are pure — or at least whose hearts she finds acceptable. She's the mount of heroes, and she knows it.",
      "notes": "The pegasus is your noble flying mount. She's fast, she's elegant, and she's morally selective — she won't carry evil characters, which creates interesting party dynamics. Her flight is silent, making her an excellent scout mount. She fights reluctantly, preferring flight over combat.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    }
  ]
}