{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Saddle & Fang — Dinosaur Mounts",
  "packId": "dinosaur_mounts",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Tyrannosaurus Rex",
      "desc": "Forty feet of muscle, teeth, and terrible purpose. She doesn't chase — she lunges, and what she lunges at stops being alive. The T-Rex is the apex predator of every world she inhabits, and riding one is somewhere between brave and suicidal.",
      "notes": "The T-Rex is your prestige dinosaur mount. She's enormous, she's lethal, and she terrifies everything smaller than herself — which is everything. Her bite attack is devastating. The challenge is controlling her — she's a predator, not a horse, and she eats what she kills, including things the players wanted alive.",
      "image": "",
      "size": 10,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [],
      "toughLevel": 3,
      "armourLevel": -1,
      "speedLevel": 0,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Triceratops",
      "desc": "Armoured, horned, and built like a living siege engine. She charges through obstacles that stop lighter creatures and her bony frill protects her rider from frontal attacks. She's not fast, but when eight tons of horned dinosaur is heading your way, speed is your problem, not hers.",
      "notes": "The triceratops is your tank mount. The frill provides natural cover, the charge attack is devastating, and she's tough enough to absorb damage that would kill a horse. Use her for battle scenarios where the players need a living battering ram.",
      "image": "",
      "size": 8,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 3,
      "armourLevel": 1,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Velociraptor Pack",
      "desc": "Not one mount — six. A pack of feathered predators that hunt with coordinated intelligence, overwhelming prey through speed, numbers, and an unsettling ability to flank. The rider doesn't ride them. The rider runs with them.",
      "notes": "The raptor pack is a unique mount concept — the player directs a pack rather than riding a single animal. They provide Gang Up bonuses, coordinate attacks, and overwhelm single targets. Each raptor is fragile individually. The pack is devastating collectively.",
      "image": "",
      "size": 2,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -4,
      "speedLevel": 3,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Pteranodon",
      "desc": "A thirty-foot wingspan of leathery membrane, a beak like a spear, and the ability to soar for hours on thermals without flapping. She's the flying mount of the dinosaur age — graceful at altitude, ungainly on the ground, and capable of snatching a man from the saddle at a hundred miles an hour.",
      "notes": "The pteranodon is your dinosaur flying mount. She's a soarer, not a hoverer — she needs altitude and thermals. Use her for aerial reconnaissance and diving attacks. She can't carry heavy loads, which limits her to light riders and no heavy armour.",
      "image": "",
      "size": 4,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -4,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Ankylosaurus",
      "desc": "A living tank covered in bony armour plates and swinging a tail club that shatters bone. She's slow, she's placid, and she's virtually impervious to anything that attacks from above. She doesn't charge — she stands her ground and hits anything stupid enough to get close.",
      "notes": "The ankylosaurus is your defensive mount. Her natural armour is the highest of any dinosaur mount, and her tail club does massive damage. She can't chase anything, but she doesn't need to — she holds position and punishes anyone who approaches. Perfect for guarding a position.",
      "image": "",
      "size": 7,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 3,
      "armourLevel": 2,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Brontosaurus",
      "desc": "Seventy feet of neck, tail, and gentle herbivore. She's the largest land animal that can be ridden — a living siege tower with room for a howdah platform on her back that carries an entire war party. She steps on things accidentally and they stop existing.",
      "notes": "The brontosaurus is your mobile platform. The howdah carries multiple characters at a height that gives them an enormous tactical advantage. Her Stomp attack is incidental — she's so large that moving through occupied spaces constitutes an attack. She's the campaign's most dramatic visual.",
      "image": "",
      "size": 14,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 4,
      "armourLevel": -1,
      "speedLevel": -3,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Stegosaurus",
      "desc": "Bony plates along her spine, a spiked tail called the thagomizer, and the temperament of an armoured cow. She's not aggressive until threatened, at which point the tail becomes a weapon that can impale a horse and its rider in a single swing.",
      "notes": "The stegosaurus is your defensive herbivore mount. Her plates provide cover to the rider and the thagomizer deals heavy damage to anything behind her. She's best used in defensive positions where enemies must approach from her rear. Pair her with a forward-facing mount for all-round coverage.",
      "image": "",
      "size": 7,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Parasaurolophus",
      "desc": "A duck-billed herbivore with a hollow crest that amplifies her call into a sound that carries for miles. She's fast for her size, she moves in herds, and her alarm call warns every friendly creature in the area that danger is approaching.",
      "notes": "The parasaurolophus is your scout and alarm mount. Her call provides a long-range communication mechanic — she warns the camp of approaching danger, signals direction, and coordinates herd movements. She's faster than the armoured dinosaurs, making her useful for patrols and messengers.",
      "image": "",
      "size": 5,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 2,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Carnotaurus",
      "desc": "A medium predator with horns above her eyes and the fastest sprint speed of any large theropod. She's smaller than the T-Rex but faster, and her charge attack uses those horns as battering rams that stun prey before the bite finishes the job.",
      "notes": "The carnotaurus is your cavalry mount. She's fast enough for charge attacks, tough enough to survive melee, and her horn strike stuns targets. She's the mounted knight's dinosaur — charge, strike, wheel, charge again. She's more controllable than a T-Rex and nearly as frightening.",
      "image": "",
      "size": 6,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": 2,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Quetzalcoatlus",
      "desc": "The largest flying creature that ever lived. A forty-foot wingspan, a beak like a javelin, and the terrifying ability to launch herself from the ground into flight without a running start. She's the dragon of the dinosaur age — and she eats things the size of horses.",
      "notes": "The quetzalcoatlus is your heavy flying mount. She's larger than the pteranodon, carries more weight, and her ground-launch capability means she doesn't need a cliff to take off. Use her for heavy aerial cavalry — she carries an armoured rider and still fights effectively.",
      "image": "",
      "size": 6,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 1,
      "handlingLevel": 0,
      "woundsLevel": 0
    }
  ]
}