{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Saddle & Fang — Fantasy Bestiary Mounts",
  "packId": "fantasy_mounts",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Warhorse (Destrier)",
      "desc": "The heaviest warhorse bred for European warfare. Seventeen hands, bred for power over speed, and trained to fight as a weapon in her own right — biting, kicking, and shouldering infantry aside while her rider works the lance and sword above.",
      "notes": "The destrier is the knight's mount. She's heavier than a standard warhorse, which means a more devastating charge but slower pursuit. Her own attacks — bite and kick — make her an active combatant. Give her a Strength die and let her fight alongside the rider.",
      "image": "",
      "size": 3,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Giant Eagle",
      "desc": "An apex predator with wingspans measured in building storeys. She hunts mountain goats by diving at two hundred miles an hour and she's been doing it since before humans learned to sharpen sticks. She permits a rider because it amuses her.",
      "notes": "The bestiary eagle is the full-sized variant. She's larger than the starter version, carries heavier loads, and her dive attack is lethal against ground targets. Use her for mountain campaigns where aerial superiority matters and the eagle's territory is the entire mountain range.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -4,
      "speedLevel": 2,
      "handlingLevel": 3,
      "woundsLevel": 0
    },
    {
      "name": "Griffin",
      "desc": "Regal, predatory, and possessed of an arrogance that makes dragons look humble. She hoards gold — not for any rational purpose, but because it's shiny and she's decided it's hers. Her rider is tolerated as long as the rider keeps the treasure safe.",
      "notes": "The bestiary griffin adds the hoarding instinct. She's distracted by gold, which is both a vulnerability and a roleplaying hook. The rider must manage the griffin's acquisitive nature while using her combat capability. She's a character with feathers.",
      "image": "",
      "size": 6,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Dragon (Young)",
      "desc": "Fifty years old, which in dragon terms means she's a teenager with breath weapons. She's learning to fly, learning to fight, and learning that humans are fragile and must be handled carefully. She doesn't always remember the last part.",
      "notes": "The bestiary young dragon is fully characterised. She has a personality, preferences, and moods that affect her performance. A happy dragon fights better. A sulking dragon might refuse to fly. The rider-dragon relationship is the campaign's emotional core.",
      "image": "",
      "size": 10,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Giant Wolf",
      "desc": "Larger than the dire wolf, smarter than most dogs, and possessed of a pack loyalty that extends to her rider's companions. She howls before battle and the sound carries for miles — which means the enemy knows she's coming, but so do her allies.",
      "notes": "The giant wolf is your pack mount. Multiple wolves coordinate their attacks automatically, which makes a party of wolf-riders a terrifyingly effective cavalry force. The howl provides a communication mechanic — she calls other wolves, signals danger, or rallies scattered riders.",
      "image": "",
      "size": 4,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -3,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Pegasus",
      "desc": "Wings of pure white, hooves that strike sparks from clouds, and a selective moral compass that makes her the most exclusive mount in any army. She chooses her rider, not the other way around, and she's been known to dump unworthy candidates from altitude.",
      "notes": "The bestiary pegasus is fully morally selective. She actively tests her rider's worthiness, which creates roleplaying challenges. A paladin's pegasus might refuse to carry someone who's lied, creating party tension. Her flight is supernaturally silent — perfect for aerial stealth missions.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 1,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Giant Spider",
      "desc": "Eight metres of chitin, venom, and the unsettling intelligence of a predator that's been perfecting ambush tactics for three hundred million years. She doesn't chase — she waits, she webs, and she strikes when the prey is helpless.",
      "notes": "The bestiary spider is the ambush specialist. Her web-spinning creates terrain modifications mid-combat — she can web corridors, seal exits, and trap enemies in place. She's best used in environments she controls: caves, forests, ruined buildings. On open ground she's vulnerable.",
      "image": "",
      "size": 4,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 0,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Nightmare",
      "desc": "A horse forged in hellfire. Her hooves leave burning prints, her mane is living flame, and she gallops through the air on trails of smoke and cinder. She serves evil riders and evil riders alone — not because she chooses to, but because nothing good would survive the contact.",
      "notes": "The nightmare is the anti-pegasus. She serves evil characters and her fire damages good-aligned riders. She planes-shifts, which means she can appear anywhere and escape through hell dimensions. Use her for villain NPCs — the dark knight on the burning horse is one of fantasy's great images.",
      "image": "",
      "size": 4,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": -1,
      "speedLevel": 2,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Giant Boar",
      "desc": "A thousand pounds of tusk, bristle, and furious disposition. She charges through brush that stops horses, she fights with savage tusk attacks, and she is completely impossible to turn once she decides on a direction. She doesn't retreat. She doesn't understand the concept.",
      "notes": "The giant boar is your stubborn mount. She charges and she doesn't stop — Unstoppable Charge means no deviation once committed. She's the barbarian's mount, the orc war-mount, and the most terrifying thing to see coming out of the treeline at full gallop.",
      "image": "",
      "size": 4,
      "loco": "legs_quad",
      "mods": {},
      "weapons": [],
      "toughLevel": 2,
      "armourLevel": -2,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Hippogriff",
      "desc": "Horse body, eagle head, and easier to train than a griffin because she lacks the griffin's insufferable pride. She's the cavalry mount of elven sky-knights and human kingdoms wealthy enough to maintain aerial stables. She's loyal, responsive, and eats raw meat.",
      "notes": "The hippogriff is your trainable flying mount. Unlike the griffin, she accepts standard animal training methods. She's the sky cavalry standard — multiple hippogriffs in formation make an effective aerial strike force. She's less individually powerful than a griffin but more reliable and more numerous.",
      "image": "",
      "size": 5,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    }
  ]
}