{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Brass & Steam — Steampunk Starter",
  "packId": "steampunk_starter",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "note": "Core weapons only. For boiler pressure, clockwork engines, steam burst, and aesthetics-as-mechanics, see the full Brass & Steam supplement.",
  "vehicles": [
    {
      "name": "Steam Tank",
      "desc": "Riveted iron, a coal-fired boiler, and a turret gun that belches smoke with every shot. She's the first armoured fighting vehicle — decades before the Great War — and she runs on Victorian engineering and imperial confidence.",
      "notes": "The steam tank is your steampunk MBT. She's slow, she's loud, and she needs a stoker feeding the boiler. The boiler is the vulnerability — a hit that ruptures the boiler produces a superheated steam explosion that kills the crew.",
      "image": "",
      "size": 7,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_ww",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": -3,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Clockwork Spider",
      "desc": "A mechanical arachnid the size of a horse, driven by wound mainsprings and guided by a babbage-engine brain. She climbs walls, she crosses terrain that stops wheeled vehicles, and her clicking, whirring approach sounds like a nightmare made of brass.",
      "notes": "The clockwork spider is your steampunk mech. She climbs vertical surfaces and crosses any terrain. Her mainspring needs periodic winding, which creates a resource management mechanic. She runs down if the crew doesn't maintain her.",
      "image": "",
      "size": 4,
      "loco": "legs_quad",
      "mods": {
        "unmanned": 1
      },
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": 0,
      "speedLevel": 0,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Ornithopter",
      "desc": "Mechanical wings, a steam engine, and the conviction that flapping flight is superior to fixed-wing design. She flies, barely, and her pilot controls each wing independently through a system of levers and cables that requires three hands to operate.",
      "notes": "The ornithopter is your steampunk aircraft. She handles terribly — Piloting rolls are harder than for conventional aircraft. But she hovers, she's quiet, and she lands vertically. Use her for eccentric inventors and reconnaissance missions.",
      "image": "",
      "size": 4,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -2,
      "armourLevel": -3,
      "speedLevel": -2,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Ironclad Monitor",
      "desc": "A low-profile warship with a revolving turret and iron armour that renders her immune to wooden warships. She changed naval warfare overnight — every sailing navy in the world became obsolete the day she launched.",
      "notes": "The monitor is your steampunk naval vessel. She's slow and barely seaworthy, but her armour stops everything the age of sail can throw at her. Use her for the moment when the old world meets the new — sailing ships discovering they can't hurt this thing.",
      "image": "",
      "size": 12,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_ww",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Walking Fortress",
      "desc": "A castle on legs. Steam-powered, bristling with guns, and large enough to carry a garrison inside her iron frame. She walks across the landscape at a stately pace, and everything in her path has a choice: move aside or be stepped on.",
      "notes": "The walking fortress is your steampunk Titan. She's a mobile stronghold and a campaign set-piece. She carries enough troops and weapons to besiege a city by herself. Stopping her requires sabotage, not combat — no weapon short of another fortress can threaten her directly.",
      "image": "",
      "size": 10,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_ww",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 3,
      "armourLevel": 2,
      "speedLevel": -3,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Armoured Train",
      "desc": "Steam locomotive, armoured carriages, and gun turrets that cover both sides of the track. She's a mobile fortress that follows the rails — which means she's predictable, but along those rails she's the most powerful military asset in any campaign.",
      "notes": "The armoured train is your linear fortress. She follows rails, which limits her route but makes her devastatingly powerful along it. Use her for rail-based campaigns — protecting the train, ambushing the train, or riding the train through hostile territory.",
      "image": "",
      "size": 12,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_ww",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 0,
      "handlingLevel": -5,
      "woundsLevel": 0
    },
    {
      "name": "Steam Carriage",
      "desc": "A horseless carriage powered by a compact steam engine. She's faster than a horse, she doesn't tire, and she frightens livestock in every village she passes through. She's the future of transportation and most people aren't sure they want it.",
      "notes": "The steam carriage is your steampunk car. She's unreliable, she needs water and coal, and she startles horses. Use her for gentleman-adventurer campaigns where the vehicle is both transport and status symbol.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": -2,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Aerial Gunboat",
      "desc": "A steam-powered flying vessel carrying light cannon and a crew of six. She patrols the skies above the Empire's territories, enforcing air supremacy with Victorian politeness backed by artillery.",
      "notes": "The aerial gunboat is your steampunk air patrol vessel. She's armed enough to threaten other airships and ground targets. Use her for sky-piracy campaigns, aerial exploration, and colonial enforcement scenarios.",
      "image": "",
      "size": 8,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_ww",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": -1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Submarine (Nautilus)",
      "desc": "Captain Nemo's dream made real. She dives beneath the waves, she rams surface vessels with her reinforced prow, and she carries a crew of idealists who've left the surface world behind. She's the ultimate expression of Victorian engineering applied to warfare and independence.",
      "notes": "The Nautilus is your steampunk submarine. She operates independently, she rams rather than torpedoes, and her captain is always a character with strong opinions about the surface world. Use her for Verne-inspired campaigns of exploration, piracy, and underwater adventure.",
      "image": "",
      "size": 10,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "torpedo_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Difference Engine Walker",
      "desc": "A walking automaton guided by a mechanical computer. She follows programmed instructions with precise, clockwork loyalty and no capacity for independent thought. She does exactly what she's told, which is either reassuring or terrifying depending on who gave the instructions.",
      "notes": "The difference engine walker is your steampunk robot. She follows her programming literally, which means badly written instructions create unpredictable behaviour. She's the golem of the steampunk age — powerful, obedient, and dangerous when the programmer makes a mistake.",
      "image": "",
      "size": 6,
      "loco": "legs_quad",
      "mods": {
        "unmanned": 1
      },
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": 0,
      "woundsLevel": 0
    }
  ]
}