{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Brass & Steam — Victorian Arsenal",
  "packId": "victorian_arsenal",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Steam Tank",
      "desc": "The arsenal variant — heavier armour, bigger gun, and a boiler rated for sustained combat operations. She's the military's official answer to the question of what happens when you put a cannon inside an iron box and make it move.",
      "notes": "The arsenal steam tank is the military-grade variant. Better armour, bigger gun, proper fire control. Use her as the standard military vehicle for steampunk war campaigns. She's what the government fields while the inventors build the weird stuff.",
      "image": "",
      "size": 7,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "light_cannon_bp",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": -3,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Clockwork Spider",
      "desc": "Military specification. Her mainspring holds twice the charge, her legs are reinforced for rough terrain, and her babbage-brain has been programmed with tactical routines rather than simple navigation. She thinks, after a fashion.",
      "notes": "The military spider has combat programming — she can execute basic tactical manoeuvres autonomously. This means the pilot can focus on weapons while she handles movement. The programming can also glitch, creating amusing and dangerous malfunctions.",
      "image": "",
      "size": 4,
      "loco": "legs_quad",
      "mods": {
        "unmanned": 1
      },
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": 0,
      "speedLevel": 0,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Ornithopter",
      "desc": "The military version sacrifices some manoeuvrability for weapons hardpoints and armour plating. She carries bombs, rockets, or a nose-mounted Gatling gun. She's still difficult to fly, but now she's difficult to fly and heavily armed.",
      "notes": "The arsenal ornithopter is your steampunk attack aircraft. She's armed and armoured at the cost of handling. Use her for air-to-ground strikes where precision matters less than the shock of bombs falling from mechanical wings.",
      "image": "",
      "size": 4,
      "loco": "vtol",
      "mods": {},
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -3,
      "speedLevel": -2,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Steam Carriage",
      "desc": "The military staff car. Armoured doors, a reinforced chassis, and a pennant on the front fender that tells everyone which general is inside. She carries officers between headquarters and the front line in relative comfort and absolute visibility.",
      "notes": "The military steam carriage is your officer transport and your command vehicle. She carries VIPs through dangerous territory. Escorting her is a mission; ambushing her is an opportunity. The officer inside always has intelligence worth capturing.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": -2,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Ironclad Monitor",
      "desc": "The arsenal variant with improved turret traverse, thicker belt armour, and a secondary battery of quick-firing guns. She's the navy's primary coastal defence vessel — slow, powerful, and perfectly suited to harbour protection.",
      "notes": "The arsenal monitor is the serious warship variant. She defends ports, bombards coastal positions, and controls waterways. Use her for naval campaigns where the players must deal with a vessel that can't be outrun and can barely be hurt.",
      "image": "",
      "size": 12,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Zeppelin (Victorian)",
      "desc": "A rigid airship of the Imperial fleet. She cruises at altitude, carries a complement of marines, and rains explosive charges on positions below. She's the strategic bomber of the steampunk age — slow, majestic, and terrifyingly effective against anyone who can't reach her altitude.",
      "notes": "The Victorian zeppelin is your strategic air asset. She carries troops, bombs, and observation equipment. Her hydrogen lifting gas makes her vulnerable to incendiary weapons, which creates the classic risk: devastating from altitude, catastrophically vulnerable to fire.",
      "image": "",
      "size": 14,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "light_cannon_bp",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "bombs_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -2,
      "speedLevel": -3,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Submarine (Nautilus)",
      "desc": "The military submarine — less philosophical than Nemo's version, more focused on torpedo bays and mine-laying. She patrols beneath the surface, invisible and lethal, making the world's surface navies suddenly nervous about what's below their keels.",
      "notes": "The military submarine is your steampunk U-boat. She torpedoes, she mines, she disappears. Use her for naval campaigns where the players hunt or are hunted by something they can't see. Depth charges and ram attacks are the counters.",
      "image": "",
      "size": 10,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "torpedo_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Walking Fortress",
      "desc": "The military variant with proper gun turrets, a flag deck for the commanding officer, and garrison quarters for a company of infantry. She's a mobile headquarters that walks across the battlefield at the pace of a determined pedestrian.",
      "notes": "The arsenal walking fortress is the campaign's ultimate military asset. She commands the battlefield by presence alone. Use her for siege scenarios, breakthrough operations, and the climactic battle where the players must stop one.",
      "image": "",
      "size": 10,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 3,
      "armourLevel": 2,
      "speedLevel": -3,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Armoured Train",
      "desc": "Military specification with anti-aircraft turrets, troop carriages, and a command car for the general staff. She controls the railway network, which in the steam age means she controls the logistics of the entire theatre.",
      "notes": "The military armoured train is the logistical backbone of steampunk warfare. She carries troops, supplies, and heavy weapons along the rail network. Destroying her cripples an army. Capturing her wins the war.",
      "image": "",
      "size": 12,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "heavy_cannon_bp",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 0,
      "handlingLevel": -5,
      "woundsLevel": 0
    },
    {
      "name": "Difference Engine Walker",
      "desc": "The military automaton — programmed for combat, armoured against small arms, and deployed in formations that execute tactical manoeuvres with mechanical precision. She doesn't think, she doesn't fear, and she doesn't stop until her mainspring runs down.",
      "notes": "The military walker is your steampunk drone army. She follows orders without question, which makes her reliable and inflexible. Use them in formations — the players face a line of clockwork soldiers that advance steadily and fire in perfect unison. The counter is unpredictability.",
      "image": "",
      "size": 6,
      "loco": "legs_quad",
      "mods": {
        "unmanned": 1
      },
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": 0,
      "woundsLevel": 0
    }
  ]
}