{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Brass & Steam — Steampunk Starter",
  "packId": "steampunk_starter",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "note": "Core weapons only. For boiler pressure, clockwork engines, steam burst, and aesthetics-as-mechanics, see the full Brass & Steam supplement.",
  "vehicles": [
    {
      "name": "Steam Tank",
      "desc": "A boiler, iron plates, and a cannon — the first armoured fighting vehicle, imagined a century before it was possible. She runs on coal and water, she creaks and hisses, and she terrifies cavalry horses by her mere existence.",
      "notes": "The steam tank is your Victorian-era armoured vehicle. She's slow, she's loud, and she requires a crew of stokers as well as fighters. The boiler is her vulnerability — a penetrating hit to the boiler causes a steam explosion. Drama in every round.",
      "image": "",
      "size": 7,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_ww",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": -3,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Clockwork Spider",
      "desc": "A mechanical arachnid the size of a carriage, driven by wound springs and guided by a difference engine brain. She climbs walls, crosses ceilings, and descends into spaces no human vehicle can reach. She's the masterwork of a genius who didn't ask whether they should.",
      "notes": "The clockwork spider is your steampunk scout and infiltrator. She goes where nothing else can — vertical surfaces, narrow passages, across webs of gas pipes. Her springs need rewinding after extended operation. Use her for heists and infiltrations in vertical Victorian cities.",
      "image": "",
      "size": 4,
      "loco": "legs_quad",
      "mods": {
        "unmanned": 1
      },
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": 0,
      "speedLevel": 0,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Ornithopter",
      "desc": "Mechanical wings that beat like a bird's, driven by a steam engine or clockwork motor. She flies — badly, noisily, and with a fuel consumption that makes angels weep — but she flies. Leonardo dreamed of her. The Victorians built her.",
      "notes": "The ornithopter is your steampunk aircraft. She's slow and fragile compared to conventional aircraft but she exists in an era before conventional aircraft. She hovers, she manoeuvres in tight spaces, and she's the most dramatic way to arrive at a party.",
      "image": "",
      "size": 4,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -2,
      "armourLevel": -3,
      "speedLevel": -2,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Ironclad Monitor",
      "desc": "An iron hull, a rotating turret, and the ability to absorb broadside fire that would destroy any wooden warship. She changed naval warfare forever — the day she appeared, every wooden navy in the world became obsolete.",
      "notes": "The ironclad is your naval revolution. She makes wooden ships irrelevant, which creates the dramatic tension — a navy with one ironclad defeats a fleet of sailing ships. Use her for the pivotal moment when technology changes the rules of war.",
      "image": "",
      "size": 12,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_ww",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 2,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Walking Fortress",
      "desc": "A castle on legs. Steam-driven pistons the size of tree trunks lift her over terrain that stops wheeled vehicles. She carries a garrison, she mounts artillery, and she walks toward the enemy at the pace of a determined man. She is the statement that engineers make wars, not soldiers.",
      "notes": "The walking fortress is your steampunk super-heavy. She's a set-piece — the campaign revolves around building her, deploying her, or destroying her. She changes the strategic map by existing. The players either serve aboard her or spend the campaign finding a way to stop her.",
      "image": "",
      "size": 10,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_ww",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 3,
      "armourLevel": 2,
      "speedLevel": -3,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Armoured Train",
      "desc": "An iron-plated locomotive pulling carriages fitted with gun turrets, observation posts, and troop compartments. She commands the railway — and in the age of steam, whoever controls the railway controls the country.",
      "notes": "The armoured train controls a linear axis. She can't go off-rails, which means her route is predictable — but on that route, she's unstoppable. Use her for railway wars where controlling the line means controlling the supply network.",
      "image": "",
      "size": 12,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_ww",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 0,
      "handlingLevel": -5,
      "woundsLevel": 0
    },
    {
      "name": "Steam Carriage",
      "desc": "A horseless carriage driven by a compact steam engine, carrying passengers in brass-fitted comfort at the terrifying speed of twenty miles an hour. She startles horses, frightens pedestrians, and represents the future of personal transportation.",
      "notes": "The steam carriage is your Victorian player vehicle. She's the Model T of the steampunk world — unreliable, revolutionary, and available. Use her for street chases through gas-lit cities. Her boiler needs water and coal, creating logistics that horses don't.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -2,
      "speedLevel": -2,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Aerial Gunboat",
      "desc": "A steam-powered dirigible carrying a broadside of light cannons. She floats above the battlefield, raining fire on ground positions that have no answer to attack from above. She's the first air superiority platform and she changes warfare forever.",
      "notes": "The aerial gunboat is your steampunk close air support. She provides fire from above that ground forces can't easily counter. Her gas bag is vulnerable to incendiary attack — one fire arrow and she burns. Use her for the dramatic moment when air power appears over a Victorian battlefield.",
      "image": "",
      "size": 8,
      "loco": "vtol",
      "mods": {},
      "weapons": [
        {
          "weaponId": "autocannon_ww",
          "mount": "turret",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": -1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Submarine (Nautilus)",
      "desc": "She dives beneath the waves, she rams enemy hulls with a reinforced prow, and she operates in a realm that surface navies cannot reach. Captain Nemo's dream — or nightmare, depending on which side of the hull you're standing.",
      "notes": "The Nautilus-type submarine is your steampunk underwater vessel. She attacks from below, she explores ocean depths, and she represents science pushed to its limits. Use her for undersea adventures, harbour raids, and the mystery of who built her and why.",
      "image": "",
      "size": 10,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "torpedo_ww",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Difference Engine Walker",
      "desc": "A steam-driven bipedal walker guided by a mechanical computer — the difference engine that Babbage imagined, built into the control system of a walking machine. She thinks. Slowly, mechanically, but she thinks. And she follows her programmed instructions with terrible precision.",
      "notes": "The difference engine walker is your proto-mech. She's autonomous — guided by mechanical computation rather than a human pilot. She follows orders literally, which means poorly worded instructions produce catastrophic results. Use her as the steampunk equivalent of an AI — obedient, powerful, and dangerously literal.",
      "image": "",
      "size": 6,
      "loco": "legs_quad",
      "mods": {
        "unmanned": 1
      },
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "turret",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": 0,
      "woundsLevel": 0
    }
  ]
}