{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Rust & Ruin — Wasteland Survivors",
  "packId": "wasteland_survivors",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "vehicles": [
    {
      "name": "Salvage Truck",
      "desc": "A flatbed truck fitted with a crane, cutting equipment, and cargo racks for recovered materials. She visits the ruins of the old world and brings back the pieces the new world needs. She's the lifeblood of every settlement's workshop.",
      "notes": "The salvage truck creates expedition adventures. The players take her to a ruin, find what they need, and haul it back before the raiders arrive. She's slow and valuable — the perfect escort target.",
      "image": "",
      "size": 6,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Water Tanker",
      "desc": "More precious than the fuel tanker. She carries clean water — the one resource no settlement can survive without. In the wasteland, water is currency, water is power, and water is the reason people kill each other.",
      "notes": "The water tanker is the fuel tanker's more desperate cousin. Losing her doesn't strand the convoy — it kills the settlement. The stakes are higher, the protection more aggressive, and the raiders more determined.",
      "image": "",
      "size": 7,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Farm Tractor (Armoured)",
      "desc": "A pre-war tractor with steel plates welded to the cab and a mount for whatever weapon the settlement could spare. She ploughs the fields inside the settlement walls and fights when the raiders come for the harvest.",
      "notes": "The armoured tractor is a settlement defence vehicle. She protects the food supply. Use her for defence scenarios where the players protect the harvest — the tractor ploughs while the raiders probe the perimeter.",
      "image": "",
      "size": 5,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 3,
      "armourLevel": 1,
      "speedLevel": -4,
      "handlingLevel": -3,
      "woundsLevel": 0
    },
    {
      "name": "Jury-Rig Motorcycle",
      "desc": "Built from parts of three different bikes, a lawnmower engine, and the kind of optimism that only exists in people who've never had the option of buying something new. She works. Mostly. When she feels like it.",
      "notes": "The jury-rig bike breaks down constantly but she's repairable with whatever's available. Every journey involves a Repair roll. She's the starting player vehicle for campaigns that begin with nothing.",
      "image": "",
      "size": 1,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -4,
      "speedLevel": 1,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Armoured Schoolbus",
      "desc": "Yellow paint barely visible under welded steel plates. She carries families, children, and the settlement's future between fortress-towns. She's the school bus that refused to stop working when the world ended.",
      "notes": "The armoured schoolbus is your civilian transport. She carries non-combatants — which means the stakes are personal. The players protect children, which changes the moral calculus of every combat decision.",
      "image": "",
      "size": 7,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Sail Cart",
      "desc": "A cart with a mast and a sail, pushed by wind across the flat wastes. She carries a small crew and light cargo without burning a drop of fuel. She's the poor man's sand yacht — slower, cruder, and available to anyone with canvas and rope.",
      "notes": "The sail cart is the absolute minimum viable vehicle. She costs nothing to operate and she goes wherever the wind goes. Use her for the poorest survivors — people who can't afford fuel and make do with what the sky provides.",
      "image": "",
      "size": 3,
      "loco": "water_sail",
      "mods": {},
      "weapons": [],
      "toughLevel": -2,
      "armourLevel": -4,
      "speedLevel": -1,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Scrap Walker",
      "desc": "A bipedal walking machine built from hydraulic equipment and industrial salvage. She steps over rubble, she carries heavy loads, and she proves that wasteland engineers are capable of building things that shouldn't work but somehow do.",
      "notes": "The scrap walker is the wasteland's homebrew mech. She's crude, she's slow, and she crosses terrain that stops everything else. Use her for deep ruin exploration where wheeled vehicles can't reach. She breaks down spectacularly.",
      "image": "",
      "size": 5,
      "loco": "legs_biped",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "River Barge (Armoured)",
      "desc": "A flat-bottomed barge with steel plates along the waterline and a mounted weapon on the bow. She moves trade goods along rivers that roads no longer reach. She's slow, she's dependable, and the river pirates know exactly where she'll be.",
      "notes": "The armoured barge is your water trade vehicle. She follows the river — she can't go anywhere else — which makes ambush points predictable. River encounters are constrained by the banks, bridges, and shallows. She's a floating supply run.",
      "image": "",
      "size": 8,
      "loco": "water_turbo",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Pedal-Powered Cart",
      "desc": "A cart powered by human legs. No fuel, no animals, just effort. She moves at walking pace, she carries supplies, and she represents the absolute bottom of wasteland vehicle technology. She exists because people need to move things and have nothing else.",
      "notes": "The pedal cart is desperation made mobile. She creates Fatigue for the operators, which limits how far the party can travel. She's the vehicle for campaigns that start at the very bottom — the players have literally nothing but their own muscles.",
      "image": "",
      "size": 2,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": -3,
      "armourLevel": -4,
      "speedLevel": -4,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "Frankenstein APC",
      "desc": "The upgraded version — more armour, more weapons, and a workshop inside that lets the crew maintain other vehicles on the move. She's the mobile base of a wasteland caravan, the vehicle that keeps the convoy running.",
      "notes": "The expansion Frankenstein APC adds the mobile workshop, which changes the campaign logistics. She repairs other vehicles on the move, which means the convoy doesn't stop for maintenance. She's the most valuable non-combat asset in any wasteland group.",
      "image": "",
      "size": 7,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": -1,
      "handlingLevel": -2,
      "woundsLevel": 0
    }
  ]
}