{
  "formatVersion": "1.0",
  "exportType": "batch",
  "packName": "Rust & Ruin — Wasteland Starter",
  "packId": "wasteland_starter",
  "price": "$2.99",
  "vehicleCount": 10,
  "publisher": "DiceForge Studios Ltd.",
  "note": "Core weapons only. For fuel-as-currency, salvage tables, jury-rig construction, and wasteland hazards, see the full Rust & Ruin supplement.",
  "vehicles": [
    {
      "name": "Survivor Pickup",
      "desc": "A pre-war pickup truck held together with wire, welding, and stubbornness. She carries everything a survivor owns — tools, water, food, ammunition, and the persistent hope that the next settlement will be better than the last one.",
      "notes": "The survivor pickup is your starting vehicle. She's unreliable, she's slow, and she's all the players have. Every breakdown is a crisis, every fuel stop is an adventure, and upgrading her with salvaged parts is a campaign-long project.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": 0,
      "handlingLevel": 0,
      "woundsLevel": 0
    },
    {
      "name": "War Rig",
      "desc": "The queen of the wasteland roads. Armoured, armed, and carrying enough supplies to make a settlement rich or a war-leader powerful. She runs the trade routes between fortress-towns and everything in the desert wants what she's carrying.",
      "notes": "The war rig is your convoy centrepiece. She's what the players protect, steal, or command. A full convoy run — the rig, her escorts, and the raiders who come for her — is a session unto itself.",
      "image": "",
      "size": 9,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": 0,
      "handlingLevel": -1,
      "woundsLevel": 0
    },
    {
      "name": "Interceptor",
      "desc": "Stripped, supercharged, and built for one thing: speed. She catches what she chases and outruns what chases her. Every interceptor is a personal statement — no two are alike, and each one tells the story of who built her.",
      "notes": "The interceptor is the player's personal vehicle. She's fast, fragile, and unique. Let the players customise her — every modification reflects the character. She's their identity on wheels.",
      "image": "",
      "size": 4,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -1,
      "speedLevel": 4,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Death Bike",
      "desc": "A motorcycle held together with scrap metal and decorated with whatever the rider considers intimidating. She's fast, she's exposed, and her rider fights with one hand on the throttle and the other swinging a weapon.",
      "notes": "Death bikes are outriders. They scout, they harass, and they die in satisfying explosions when the players hit them. Use them in packs of four to six for raider encounters.",
      "image": "",
      "size": 1,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "fixed",
          "linked": 0
        }
      ],
      "toughLevel": -1,
      "armourLevel": -3,
      "speedLevel": 3,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Scrap Crawler",
      "desc": "Tracked, slow, and built from the chassis of three different vehicles welded together. She goes where wheeled vehicles can't — rubble fields, sand dunes, and the ruins of the old cities where the good salvage still waits.",
      "notes": "The scrap crawler is your exploration vehicle. She reaches places the fast vehicles can't, which means she finds the best salvage. Her slow speed makes every journey tense — she can't outrun trouble.",
      "image": "",
      "size": 6,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg_modern",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -2,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Buzz Buggy",
      "desc": "A dune buggy with a mounted gun and a crew that considers seatbelts a luxury from the old world. She's light, she's fast over sand, and she's the raider warband's favourite toy.",
      "notes": "Buzz buggies swarm. Use them as harassment vehicles that surround heavier targets and fire from every direction. Individually easy to kill, collectively a nightmare.",
      "image": "",
      "size": 2,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": -2,
      "armourLevel": -3,
      "speedLevel": 2,
      "handlingLevel": 2,
      "woundsLevel": 0
    },
    {
      "name": "Thunder Bus",
      "desc": "A welded-shut bus carrying a raider war party. She rams alongside the target, the doors blow open, and thirty screaming raiders pour out. She's a troop transport for people who don't believe in subtlety.",
      "notes": "The thunder bus delivers boarding parties. She pulls alongside, the doors open, and melee begins at highway speed. The rolling brawl is the encounter.",
      "image": "",
      "size": 7,
      "loco": "wheeled",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 1,
      "armourLevel": 0,
      "speedLevel": -1,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Sand Yacht",
      "desc": "A sail-powered land vehicle. No fuel, no engine, no noise. She glides across the flat waste on the wind and she carries people who've learned to live without the old world's combustion engines.",
      "notes": "The sand yacht uses no fuel, which makes her invaluable in the wasteland. She's silent and she runs forever. Use her for nomadic cultures and long-range travel when fuel is scarce.",
      "image": "",
      "size": 4,
      "loco": "water_sail",
      "mods": {},
      "weapons": [],
      "toughLevel": -3,
      "armourLevel": -4,
      "speedLevel": 0,
      "handlingLevel": 1,
      "woundsLevel": 0
    },
    {
      "name": "Fuel Tanker",
      "desc": "The most valuable vehicle in the wasteland. She carries fuel — the blood of civilisation — and everyone wants what she has. Protecting her is a career. Stealing from her is a lifestyle.",
      "notes": "The fuel tanker is the MacGuffin on wheels. She's also a rolling bomb. Every firefight near her carries the risk of catastrophic explosion. That tension defines every encounter.",
      "image": "",
      "size": 8,
      "loco": "wheeled",
      "mods": {},
      "weapons": [],
      "toughLevel": 0,
      "armourLevel": -1,
      "speedLevel": -1,
      "handlingLevel": -2,
      "woundsLevel": 0
    },
    {
      "name": "Frankenstein APC",
      "desc": "An armoured personnel carrier stitched together from military surplus, construction equipment, and whatever plate steel the workshop had available. She's ugly, she's heavy, and she carries a squad of survivors who feel almost safe inside her.",
      "notes": "The Frankenstein APC is the best protection the wasteland offers. She's armoured enough to stop small arms and carries a full party. She's also unreliable — mechanical failures should be frequent and dramatic.",
      "image": "",
      "size": 7,
      "loco": "tracked",
      "mods": {},
      "weapons": [
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        },
        {
          "weaponId": "hmg",
          "mount": "pintle",
          "linked": 0
        }
      ],
      "toughLevel": 2,
      "armourLevel": 1,
      "speedLevel": -1,
      "handlingLevel": -2,
      "woundsLevel": 0
    }
  ]
}